{
    "appbackend#state-starting-body": {
        "message": "请稍候...",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server"
    },
    "settings#local-proxy-ports#error-modal-body-http": {
        "message": "<p>\n您已配置赛风使用指定的本地端口开启 HTTP 代理。<br>\n然而，此端口似乎已被占用，赛风无法使用之。\n</p>\n<p>\n请更改配置的 HTTP 代理端口值然后再试。我们建议您清除该值，使赛风自动挑选可用端口。\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the HTTP proxy port, rather than the SOCKS proxy port."
    },
    "settings#upstream-proxy#set-both-error-msg": {
        "message": "您必须同时设置主机名和端口，或者留空两项表示自动选择。",
        "description": "Error message that is shown if the user enters a value for one of 'Upstream Hostname' or 'Upstream Port', but not for both -- this is not valid, as both are required. Alternatively, the user can leave both blank to allow the automatic behaviour."
    },
    "settings#egress-region#select-jp": {
        "message": "日本",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Japan will be used."
    },
    "settings#upstream-proxy#error-modal-body-configured": {
        "message": "您已配置赛风使用一个“上层代理”。<br>\n然而，我们似乎无法通过该代理连接到赛风服务器。<br>\n请修正设置后再试。",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has directly altered these settings, and those settings are (probably) erroneous."
    },
    "logs#show-debug-label": {
        "message": "显示调试日志",
        "description": "Label on a checkbox. If the user checks it, debug log messages will be shown to the user."
    },
    "nav#logs": {
        "message": "日志",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Logs' view. In that view the user can see the status messages that Psiphon produces as it connects, disconnects, etc."
    },
    "settings#error-alert": {
        "message": "<strong>错误！</strong>请在继续前修正错误设置值。",
        "description": "This alert is shown to the user if they enter incorrect values into one or more of the settings fields."
    },
    "settings#local-proxy-ports#reason": {
        "message": "如果您在电脑上使用了需要手动配置才能利用赛风的工具，您可能希望赛风始终使用同一个本地端口号。如果您没有特定的理由来指定端口号，您应该允许赛风自动选择端口号，这样可以避免端口冲突。",
        "description": "Help text in the 'Local Proxy Ports' settings area. This explains to the user why they might want to override the default (automatic) settings values."
    },
    "appbackend#minimized-to-systray-body": {
        "message": "点击图标恢复应用程序",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons)."
    },
    "banner#sponsored-by": {
        "message": "赞助者：",
        "description": "Text appears above the sponsor banner image. So it kind of reads 'Sponsored by BBC' (for example)."
    },
    "appbackend#state-connected-body": {
        "message": "探索边界外面的世界！",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed. This is intended to be a reference to the 'Psiphon: Beyond Borders' tag line. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system."
    },
    "connection#connected-msg": {
        "message": "赛风 <span class=\"state-word\">已连接</span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently connected to the network."
    },
    "settings#split-tunnel#reason": {
        "message": "您所在国家的网站一般不会被封锁，因此启用此选项可以让您更快地访问这些网站，有时还可降低 ISP 数据流量费用。",
        "description": "Help text in the 'Split Tunnel' settings section explaining to the user why they might want to modify (enable) the setting."
    },
    "nav#settings": {
        "message": "设置",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Settings' view. In that view the user can change the settings/options that change how Psiphon works."
    },
    "nav#connection#connected": {
        "message": "已连接",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connected."
    },
    "settings#egress-region#error-modal-title": {
        "message": "服务器区域不可用",
        "description": "Title text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured."
    },
    "settings#upstream-proxy#error-modal-title": {
        "message": "上层代理错误",
        "description": "Title of the message box showing the error message when a problem is detected with the user's 'upstream proxy settings'."
    },
    "settings#egress-region#default": {
        "message": "选择默认的<strong>“最快的国家”</strong>选项以允许赛风自动选择服务器，通常会得到最好的网络连接质量。",
        "description": "Help text below the 'Psiphon Server Region' combo box. It explains to the user what the default (and best) option is."
    },
    "connection#stopping-msg": {
        "message": "赛风 <span class=\"state-word\">断开连接中</span>…",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to disconnect from the network."
    },
    "settings#upstream-proxy#error-modal-body-default": {
        "message": "赛风当前使用您的系统代理作为其“上层代理”。<br>\n然而，我们似乎无法通过该代理连接到赛风服务器。<br>\n请启用“不使用上层代理”后再试。",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has not directly altered these settings (yet), but the default is causing a problem."
    },
    "feedback#success-message": {
        "message": "<strong>谢谢！</strong>您的反馈已经发出。",
        "description": "Message shown to user after their feedback has been sent successufully"
    },
    "appbackend#state-stopped-title": {
        "message": "Psiphon 已中断连接",
        "description": "Appears in the notification area balloon when Psiphon is disconnected (or has lost its connection, or has been disconnected)"
    },
    "settings#split-tunnel#help-text": {
        "message": "如果启用，发往您所在国家服务器的请求将不会经过赛风隧道。",
        "description": "Text explaining to the user what the 'Split Tunnel' setting does if enabled."
    },
    "about#visit-download-site": {
        "message": "请访问网站<strong><a class=\"NewVersionURL\" href=\"#\">下载最新版本</a></strong>或者<strong><a class=\"InfoURL\" href=\"#\">获取帮助和相关信息</a></strong>。Psiphon 在 Android 和 Windows 平台上可用。",
        "description": "Paragraph on the 'About' page telling users what web page to go to get a new version of Psiphon or more info about it."
    },
    "settings#upstream-proxy#skip-label": {
        "message": "不使用上层代理",
        "description": "Label for the checkbox that allows the user to override the default 'upstream proxy' usage and totally disable the feature."
    },
    "settings#systray-minimize#help-text": {
        "message": "如果启用，在最小化赛风应用程序的窗口时，将会将其隐藏到通知区域（也称“系统托盘”，位于您的 Windows 任务栏的时钟区域旁边）。",
        "description": "Text explaining to the user what the 'Minimize to Notification Area (System Tray)' setting does if enabled."
    },
    "settings#upstream-proxy#port-label": {
        "message": "端口",
        "description": "Label for the text box where the user can set the network port number for the 'upstream proxy' that they would like to use."
    },
    "settings#port-value-error-msg": {
        "message": "必须在 1 到 65535 之间。",
        "description": "Error text that appears when the user enters an invalid network port number. As indicated, a valid port number must be a number between 1 and 65535, inclusive. This text is not visible until an invalid value is entered."
    },
    "nav#feedback": {
        "message": "反馈",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Feeback' view. In that view the user can send feedback about their experience to Psiphon."
    },
    "connection#starting-msg": {
        "message": "赛风 <span class=\"state-word\">正在连接</span>…",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to connect to the network."
    },
    "settings#applying-message": {
        "message": "重新连接以应用您的设置。",
        "description": "Pop-up message shown to users after they have changed their settings and a reconnection is happening to apply the new settings."
    },
    "appbackend#state-starting-title": {
        "message": "Psiphon 正在连接",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server"
    },
    "settings#unapplied-changes-prompt#title": {
        "message": "设置已更改",
        "description": "Title of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#egress-region#select-us": {
        "message": "美国",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the United States will be used."
    },
    "feedback#top_para_2": {
        "message": "许多问题可以通过下载赛风的最新版本解决。您可以<a class=\"NewVersionURL\" href=\"#\">点击这里下载最新版本</a>，或发送电子邮件至<a class=\"NewVersionEmail\" href=\"#\"></a>。",
        "description": "Text telling the user that downloading a new version of Psiphon may be beneficial, and how to get a new version."
    },
    "notice#systemproxysettings-setproxy-error-body": {
        "message": "<p>Psiphon 更改系统的代理设置失败了。</p>\n<p>这可能是由于和您的防病毒软件冲突所致。您可能需要手动修改应用或系统的代理配置以便使用本地的 Psiphon 代理。</p>",
        "description": "Body text of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon."
    },
    "settings#local-proxy-ports#error-modal-body-socks": {
        "message": "<p>\n您已配置赛风使用指定的本地端口开启 SOCKS 代理。<br>\n然而，此端口似乎已被占用，赛风无法使用之。\n</p>\n<p>\n请更改配置的 SOCKS 代理端口值然后再试。我们建议您清除该值，使赛风自动挑选可用端口。\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the SOCKS proxy port, rather than the HTTP proxy port."
    },
    "feedback#submit_button": {
        "message": "提交",
        "description": "Submit button text. If the user clicks it, their feedback will be sent to Psiphon Inc."
    },
    "settings#systray-minimize#reason": {
        "message": "最小化赛风到通知区域（系统托盘）可以释放您的任务栏上的空间。这在您需要长时间运行赛风时非常有益。",
        "description": "Help text in the 'Minimize to Systray' settings section explaining to the user why they might want to enable it."
    },
    "settings#unapplied-changes-prompt#discard-button": {
        "message": "放弃",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will discard the changes -- that is, throw away the changes to the settings the user has made since viewing the settings tab.  Should be read like the verb in 'Discard your changes'."
    },
    "notice#systemproxysettings-setproxy-error-title": {
        "message": "系统代理错误",
        "description": "Title of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon."
    },
    "settings#egress-region#label": {
        "message": "连接经由",
        "description": "The label for the 'Psiphon Server Region' combo box control located on the settings tab. It should be read like 'Connect via Great Britain' or 'Connect via Japan' or 'Connect via Fastest Server'."
    },
    "settings#local-proxy-ports#socks-label": {
        "message": "SOCKS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon SOCKS process. The full term for this would be 'Desired SOCKS local proxy port', but is shortened. 'SOCKS' is a proxy protocol. Any user for whom this setting is useful will know what that means."
    },
    "feedback#top_para_3": {
        "message": "您也可以在我们的<a class=\"FaqURL\" href=\"#\">常见问题</a>中找到许多常见问题的解决方案。",
        "description": "Text telling the user how to get to the Psiphon FAQ."
    },
    "settings#saved-message": {
        "message": "设置已保存。",
        "description": "Pop-up message shown to users after they have changed their settings (but they aren't currently connected, so there's no reconnect or further action)."
    },
    "about#get-by-email": {
        "message": "<strong>如果网站无法访问</strong>，您可以发送邮件至如下地址以获取新版本的赛风：",
        "description": "Paragraph on the 'About' page telling users that they can also get a new version of Psiphon via email. The text in this resource is then followed by an email address."
    },
    "settings#egress-region#select-nl": {
        "message": "荷兰",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the Netherlands will be used."
    },
    "general#modal-close-button": {
        "message": "关闭",
        "description": "Text in the button that dismisses a modal dialog. It is often the only button (no 'OK' or 'Cancel', etc.)."
    },
    "settings#local-proxy-ports#http-label": {
        "message": "HTTP/HTTPS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon HTTP/HTTPS process. The full term for this would be 'Desired HTTP and HTTPS local proxy port', but is shortened."
    },
    "settings#unapplied-changes-prompt#apply-button": {
        "message": "应用",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will apply the changes -- that is, save the changes and make them immediately take effect. Should be read like the verb in 'Apply your changes'."
    },
    "settings#reset-button": {
        "message": "重置为默认值",
        "description": "Text on the button that resets the Psiphon settings values to default. This will typically be pressed if the user has configured something incorrectly and needs to get back to the default state."
    },
    "about#client-version": {
        "message": "赛风 Windows 客户端版本：",
        "description": "Footer on the 'About' page indicating the client version number. This text is the prefix to the actual number. Like: 'Psiphon for Windows client version: 88'."
    },
    "settings#upstream-proxy#heading": {
        "message": "上层代理",
        "description": "Settings section heading. In this section the user can specify network information to use an 'upstream proxy', which is a separate proxy that Psiphon will connect through to get to its own server. This is most often used by people in school or work networks that force them to connect out to the Internet through a particular server. This setting can also disable automatic upstream proxy use."
    },
    "settings#egress-region#description": {
        "message": "赛风在多个国家部署了服务器。使用靠近您所在国家的赛风服务器通常可以获得更好的网络质量，而您也可能希望使用一个特定国家的服务器来访问网站和服务。",
        "description": "Help text in the 'Psiphon Server Region' settings section explaining what the option is and why the user may want to override the default ('best') setting value."
    },
    "settings#vpn-incompatible-msg": {
        "message": "（不能用于 L2TP/IPSec 模式）",
        "description": "If 'L2TP/IPSec mode' is enabled, this text is displayed under or beside settings which are incompatible with L2TP/IPSec mode and have been disabled because of it. It is intended to let the user know why the setting has been disabled."
    },
    "general#notice-modal-tech-preamble": {
        "message": "这里是技术性的错误信息：",
        "description": "Preamble before the technical message relating to the error being shown. This is generated within the code and may not be very user-friendly (but it may be necessary for the user to figure out what's wrong)."
    },
    "settings#local-proxy-ports#unique-error-msg": {
        "message": "本地端口必须互异。",
        "description": "Error message that shows if the HTTP local proxy port and SOCKS local proxy port are set to a value and are the same as each other. The local ports must be different from each other. Or one or both of the fields can be empty, which means 'automatic selection'."
    },
    "settings#vpn-incompatible-label": {
        "message": "L2TP/IPSec",
        "description": "If 'L2TP/IPSec mode' is enabled, this text shows up in a label beside the Settings sections which are incompatible with L2TP/IPSec mode. It is intended to draw the user's attention to the fact that some of the other settings have become disabled."
    },
    "settings#error-modal#body": {
        "message": "设定中有错误，请先更正再继续。",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This body is the title of the modal box."
    },
    "nav#connection#stopped": {
        "message": "已中断连接",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnected."
    },
    "settings#local-proxy-ports#heading": {
        "message": "本地代理端口",
        "description": "Settings section heading. In this section the user can specify what network ports the local Psiphon processes should use (Psiphon uses two such ports). For most people, this should be set to automatic."
    },
    "settings#egress-region#select-de": {
        "message": "德国",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Germany will be used."
    },
    "notice#systemproxysettings-setproxy-warning-template": {
        "message": "Psiphon 更改名为“<%- data %>”的网络连接的系统代理设置失败了。这可能是由于和您的防病毒软件冲突所致。您可能需要手动修改应用或系统的代理配置以便使用本地的 Psiphon 代理。",
        "description": "'<%- data %>' is a placeholder and must not be modified. Log message emitted when Psiphon can't fully configure the system to use Psiphon. It may or may not be a fatal state, and may or may not need human intervention."
    },
    "connection#stop-btn": {
        "message": "停止",
        "description": "Text on the big connection button telling the user that if they click it, they will stop trying to connect to the network. This is shown to the user when they are trying to connect."
    },
    "settings#egress-region#error-modal-body-http": {
        "message": "您已配置赛风使用一个特定区域的服务器。<br>\n但是，该区域不再可用。<br>\n您必须选择一个新的区域，或者更改为默认的“最快的国家”选项。",
        "description": "Descriptive body text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured."
    },
    "feedback#text_feedback_bottom_para": {
        "message": "如果以上表单无法使用，或者阁下想发送截图，请给我们发电邮至<a id=\"FeedbackEmailAddress\" href=\"mailto:feedback@psiphon.ca\">feedback@psiphon.ca</a>。",
        "description": "Message showing the user an email they can use to contact Psiphon Inc."
    },
    "settings#upstream-proxy#reason": {
        "message": "有些地方如学校和企业等需要使用上层代理。如果您的网络提供者给过您上层代理的参数，请在此手动设置之以便成功连接。",
        "description": "Help text describing why the user might need to modify the upstream proxy settings in order to successfully connect to the Psiphon server."
    },
    "settings#local-proxy-ports#error-modal-title": {
        "message": "本地代理端口冲突",
        "description": "Title of the message box showing the error message when it is detected that the user has chosen a local proxy port (either HTTP or SOCKS) that is already in use and therefore can't be used by Psiphon."
    },
    "connection#disconnect-btn": {
        "message": "中断连接",
        "description": "Text on the big connection button telling the user that if they click it, they will be disconnected from the network. This is shown when the user is currently connected."
    },
    "feedback#top_content_title": {
        "message": "向我们提供您的反馈",
        "description": "Title for the Feedback page"
    },
    "banner#long-connecting": {
        "message": "<strong>真遗憾！</strong>您似乎在连接时遇到了麻烦。<br>\n从<a class=\"NewVersionURL\" href=\"#\">下载网站</a>下载赛风的最新版本，或者向我们发邮件至 <a class=\"NewVersionEmail\" href=\"#\"></a>",
        "description": "Message that appears when Psiphon is having trouble connecting. Often such connection problems can be fixed by downloading a new version."
    },
    "logs#placeholder": {
        "message": "尚无日志",
        "description": "Placeholder text shown when there are not yet any log messages to show. This message is removed when the first log message is added."
    },
    "connection#stopped-msg": {
        "message": "赛风 <span class=\"state-word\">连接已中断</span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently not connected to the network."
    },
    "nav#about": {
        "message": "关于",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'About' view. In that view the user can see info about the app, info about Psiphon Inc., and click links for more information."
    },
    "settings#local-proxy-ports#leave-blank": {
        "message": "<strong>留空</strong>以自动选择端口（推荐）。",
        "description": "Help text that appears above the 'Local Proxy Ports' settings. 'blank' is the default and best value, and is bolded."
    },
    "settings#systray-minimize#heading": {
        "message": "最小化到通知区域（系统托盘）",
        "description": "Settings section heading. In this section the user can choose to enable or disable the ability for the Psiphon application window to be hidden as a notification area icon when minimized. 'Notification area' is the official term for the icons located near the clock on the Windows taskbar, but it's also often called the 'system tray' or 'systray' -- use whatever is most common in your language, and be verbose if necessary."
    },
    "language#success-message": {
        "message": "<strong>你好！</strong>欢迎使用赛风。",
        "description": "A welcome message shown to the user when they first switch to the correct UI language"
    },
    "settings#egress-region#select-sg": {
        "message": "新加坡",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Singapore will be used."
    },
    "feedback#diagnostic_check": {
        "message": "上传诊断数据。请注意此诊断数据不会泄露您的身份，它将帮助我们保持赛风平稳运行。<a class=\"DataCollectionInfoURL\" href=\"#\">点击这里查看我们收集的数据。</a>",
        "description": "Checkbox text. If it is checked, diagnostic information about Psiphon's status will be sent along with the feedback to Psiphon Inc."
    },
    "settings#transport-mode#heading": {
        "message": "传输模式",
        "description": "Settings section heading. In this section the user can choose to use an alternative connection and data transfer method -- also known as 'transport'."
    },
    "about#description": {
        "message": "赛风是一个<strong>规避审查的工具</strong>——旨在提供开放的互联网访问，绕过审核与防火墙。其为<strong>开源软件</strong>，开发于加拿大多伦多。",
        "description": "Paragraph on the 'About' page telling users generally what Psiphon is."
    },
    "nav#connection#stopping": {
        "message": "正在中断连接",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnecting."
    },
    "settings#error-modal#title": {
        "message": "设定错误",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This string is the title of the modal box."
    },
    "settings#apply-button": {
        "message": "应用更改",
        "description": "Text on the button that applies (saves and makes active) the changes that the user has made to their settings. It is only enabled when changes have been made. The text is effectively an abbreviation of 'Apply the changes you have made to your settings'."
    },
    "appbackend#minimized-to-systray-title": {
        "message": "Psiphon 已最小化到通知区域",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons)."
    },
    "settings#split-tunnel#heading": {
        "message": "拆分隧道",
        "description": "Settings section heading. If the user clicks this, the 'Split Tunnel' section will expand and can be edited. If 'split tunnel' is enabled, if the user is trying to get to a website in his/her own country, they will connect to it directly, instead of through Psiphon."
    },
    "settings#egress-region#invalid-error-msg": {
        "message": "请选择一个有效的赛风服务器区域。",
        "description": "Error message that is visible when the 'Psiphon Server Region' setting is invalid or not yet set."
    },
    "appbackend#state-connected-title": {
        "message": "Psiphon 已连接",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed."
    },
    "settings#upstream-proxy#proxy-reqs": {
        "message": "只允许支持 HTTPS 的 HTTP 代理。",
        "description": "Help text beside the upstream proxy settings indicating what type of upstream proxies can by used by Psiphon (different proxies are of different types and have different capabilities, and Psiphon has certain requirements)."
    },
    "settings#transport-mode#check-label": {
        "message": "使用 L2TP/IPSec 模式",
        "description": "Label for the checkbox that allows the user to indicate that they want to use the non-default network transport mode. This mode is generally inferior for circumvention and not recommended. 'L2TP/IPSec' is the technical name for a type of virtual private network and should probably not be translated."
    },
    "connection#egress-region-combo-label": {
        "message": "连接经由",
        "description": "The label for the 'Psiphon Server Region' combo box control located on the connection tab. It should be read like 'Connect via Great Britain' or 'Connect via Japan' or 'Connect via Fastest Server'."
    },
    "settings#egress-region#select-gb": {
        "message": "英国",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the UK will be used."
    },
    "about#wordart-title": {
        "message": "赛风",
        "description": "The application/product/tool name part of the fancy title at the top of the 'About' page. 'Psiphon' can be translated or transliterated if appropriate for your language. 'Beyond Borders' is the slogan that is also used on the Psiphon website -- it is meant to suggest that Psiphon can help users to get to the internet beyond the border (firewall) of the country they live in. If appropriate for your language, it should be in all capital letters."
    },
    "settings#upstream-proxy#hostname-label": {
        "message": "主机名称",
        "description": "Label for the text box where the user can set the hostname for the 'upstream proxy'. 'Hostname' means approximately the same thing as 'server network name or identifier'."
    },
    "feedback#smiley_sad": {
        "message": "赛风经常连接失败或表现不尽人意。",
        "description": "The text below the 'sad face' feedback choice."
    },
    "settings#unapplied-changes-prompt#body": {
        "message": "您更改了设置，但尚未应用之。<br><br>请问是要应用更改还是放弃？",
        "description": "Body text of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#systray-minimize#enable-label": {
        "message": "最小化到通知区域（系统托盘）",
        "description": "The label on the checkbox that enables 'Minimize to Notification Area (System Tray)'."
    },
    "settings#egress-region#heading": {
        "message": "赛风服务器区域",
        "description": "Settings section heading. In this section the user can choose to use a Psiphon server in a specific country/region (or the default, which is just to choose the best/fastest region). "
    },
    "settings#upstream-proxy#by-default": {
        "message": "如果您的电脑已经配置了代理，默认情况下赛风将在建立隧道时使用该代理。您可以指定要使用的代理或者要求不使用“上层代理”来更改默认行为。",
        "description": "Help text indicating the default (and best) configuration and behavior for the 'Upstream Proxy' setting. It also indicates what will happen if the setting is overridden or disabled."
    },
    "settings#split-tunnel#enable-label": {
        "message": "不代理您所在国家内的网站",
        "description": "The label on the checkbox that enables 'Split Tunnel'."
    },
    "nav#connection#starting": {
        "message": "正在连接",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connecting."
    },
    "feedback#text_feedback_email_prompt": {
        "message": "如果您期望我们回复，请输入您的电子邮件地址：",
        "description": "Label for a text field where the user can provide an email address to Psiphon Inc. along with their feedback."
    },
    "feedback#text_feedback_prompt": {
        "message": "请在这里输入您的意见：",
        "description": "Label for a text box where the user can provide a feedback message to Psiphon Inc."
    },
    "feedback#smiley_happy": {
        "message": "赛风的连接和表现如我所愿。",
        "description": "The text below the 'happy face' feedback choice."
    },
    "about#wordart-tag": {
        "message": "超越国界",
        "description": "The application/product/tool tagline/slogan/motto part of the fancy title at the top of the 'About' page. 'Beyond Borders' is the slogan that is also used on the Psiphon website -- it is meant to suggest that Psiphon can help users to get to the internet beyond the border (firewall) of the country they live in."
    },
    "connection#wait-btn": {
        "message": "请稍候...",
        "description": "Text on the big connection button telling the user to wait while Psiphon tries to disconnect from the network. When this message is shown, the button is disabled."
    },
    "settings#transport-mode#help-text": {
        "message": "使用 Windows L2TP/IPSec 虚拟网络。此模式将转接您的所有应用程序，但并不提供混淆效果，因此不具有很强的规避审查能力。<strong>不推荐</strong>用它来绕过大多数防火墙。",
        "description": "Help text for the 'Use L2TP/IPSec mode' transport selection checkbox. It gives some technical details and indicates that this mode is not recommended."
    },
    "settings#egress-region#select-best-performance": {
        "message": "最快的国家",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. This is the default option and indicates that Psiphon will use a server in the best/fastest region."
    },
    "connection#connect-btn": {
        "message": "连接",
        "description": "Text on the big connection button telling the user that if they click it, Psiphon will start trying to connect to the network. This is shown to the user while Psiphon is disconnected."
    }
}