{
    "banner#long-connecting": {
        "message": "<strong>Oh no!</strong>\nSembra che tu abbia problemi di connessione!<br>\nScarica l'ultima versione di Psiphon dal <a class=\"NewVersionURL\" href=\"#\">sito download</a>\no inviando un'e-mail a <a class=\"NewVersionEmail\" href=\"#\"></a>",
        "description": "Message that appears when Psiphon is having trouble connecting. Often such connection problems can be fixed by downloading a new version. The word 'Psiphon' must not be translated or transliterated."
    },
    "nav#connection#starting": {
        "message": "Connessione in corso",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connecting."
    },
    "nav#connection#connected": {
        "message": "Connesso",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connected."
    },
    "nav#connection#stopping": {
        "message": "Disconnessione",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnecting."
    },
    "nav#connection#stopped": {
        "message": "Disconnesso",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnected."
    },
    "nav#settings": {
        "message": "Impostazioni",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Settings' view. In that view the user can change the settings/options that change how Psiphon works."
    },
    "nav#feedback": {
        "message": "Feedback",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Feeback' view. In that view the user can send feedback about their experience to Psiphon."
    },
    "nav#logs": {
        "message": "Log",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Logs' view. In that view the user can see the status messages that Psiphon produces as it connects, disconnects, etc."
    },
    "nav#about": {
        "message": "Informazioni",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'About' view. In that view the user can see info about the app, info about Psiphon Inc., and click links for more information."
    },
    "connection#starting-msg": {
        "message": "Psiphon in <span class=\"state-word\">connessione</span>...",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to connect to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#stop-btn": {
        "message": "Stop",
        "description": "Text on the big connection button telling the user that if they click it, they will stop trying to connect to the network. This is shown to the user when they are trying to connect."
    },
    "connection#connected-msg": {
        "message": "Psiphon è <span class=\"state-word\">connesso</span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently connected to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#disconnect-btn": {
        "message": "Disconnetti",
        "description": "Text on the big connection button telling the user that if they click it, they will be disconnected from the network. This is shown when the user is currently connected."
    },
    "connection#stopping-msg": {
        "message": "Psiphon in <span class=\"state-word\">disconnessione</span>…",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to disconnect from the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#wait-btn": {
        "message": "Attendere…",
        "description": "Text on the big connection button telling the user to wait while Psiphon tries to disconnect from the network. When this message is shown, the button is disabled."
    },
    "connection#stopped-msg": {
        "message": "Psiphon è <span class=\"state-word\">disconnesso</span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently not connected to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#connect-btn": {
        "message": "Connessione",
        "description": "Text on the big connection button telling the user that if they click it, Psiphon will start trying to connect to the network. This is shown to the user while Psiphon is disconnected."
    },
    "connection#egress-region-combo-label": {
        "message": "Select server region",
        "description": "The label for the 'Psiphon Server Region' combo box control located on the connection tab."
    },
    "settings#error-alert": {
        "message": "<strong>Errore!</strong> Correggere i valori errati prima di procedere.",
        "description": "This alert is shown to the user if they enter incorrect values into one or more of the settings fields."
    },
    "settings#reset-button": {
        "message": "Ripristina configurazione predefinita",
        "description": "Text on the button that resets the Psiphon settings values to default. This will typically be pressed if the user has configured something incorrectly and needs to get back to the default state."
    },
    "settings#apply-button": {
        "message": "Applica modifiche",
        "description": "Text on the button that applies (saves and makes active) the changes that the user has made to their settings. It is only enabled when changes have been made. The text is effectively an abbreviation of 'Apply the changes you have made to your settings'."
    },
    "settings#unapplied-changes-prompt#title": {
        "message": "Impostazioni modificate",
        "description": "Title of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#unapplied-changes-prompt#body": {
        "message": "Hai apportato modifiche alle tue impostazioni, ma non le hai applicate.<br><br> Desideri applicare le modifiche?",
        "description": "Body text of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#unapplied-changes-prompt#apply-button": {
        "message": "Applica",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will apply the changes -- that is, save the changes and make them immediately take effect. Should be read like the verb in 'Apply your changes'."
    },
    "settings#unapplied-changes-prompt#discard-button": {
        "message": "Elimina",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will discard the changes -- that is, throw away the changes to the settings the user has made since viewing the settings tab.  Should be read like the verb in 'Discard your changes'."
    },
    "settings#vpn-incompatible-msg": {
        "message": "(Non funziona in modalità L2TP/IPSec.)",
        "description": "If 'L2TP/IPSec mode' is enabled, this text is displayed under or beside settings which are incompatible with L2TP/IPSec mode and have been disabled because of it. It is intended to let the user know why the setting has been disabled."
    },
    "settings#vpn-incompatible-label": {
        "message": "L2TP/IPSec",
        "description": "If 'L2TP/IPSec mode' is enabled, this text shows up in a label beside the Settings sections which are incompatible with L2TP/IPSec mode. It is intended to draw the user's attention to the fact that some of the other settings have become disabled."
    },
    "settings#split-tunnel#heading": {
        "message": "Split Tunnel",
        "description": "Settings section heading. If the user clicks this, the 'Split Tunnel' section will expand and can be edited. If 'split tunnel' is enabled, if the user is trying to get to a website in his/her own country, they will connect to it directly, instead of through Psiphon."
    },
    "settings#split-tunnel#help-text": {
        "message": "Se abilitato, le richieste inoltrate ai server della tuo paese, non saranno gestite da Psiphon.",
        "description": "Text explaining to the user what the 'Split Tunnel' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#split-tunnel#reason": {
        "message": "Websites within your home country are generally not blocked, so enabling this option will give you faster access to those sites and can sometimes reduce ISP data usage costs.",
        "description": "Help text in the 'Split Tunnel' settings section explaining to the user why they might want to modify (enable) the setting."
    },
    "settings#split-tunnel#enable-label": {
        "message": "Non usare proxy per i siti del tuo paese",
        "description": "The label on the checkbox that enables 'Split Tunnel'."
    },
    "settings#disable-timeouts#heading": {
        "message": "Disattiva timeout per reti lente",
        "description": "Settings section heading. If the user clicks this, the 'Disable Timeouts for Slow Networks' section will expand and can be edited. If 'disable timeouts' is enabled, network timeouts between the Psiphon client and server will be disabled."
    },
    "settings#disable-timeouts#help-text": {
        "message": "Se abilitato, la comunicazione con il server Psiphon non terminerà.",
        "description": "Text explaining to the user what the 'Disable Timeouts' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#disable-timeouts#reason": {
        "message": "When enabling this for a very slow network connection, you are less likely to experience unexpected disconnections.",
        "description": "Help text in the 'Disable Timeouts' settings section explaining to the user why they might want to modify (enable) the setting."
    },
    "settings#disable-timeouts#enable-label": {
        "message": "Disattiva timeout per reti lente",
        "description": "The label on the checkbox that enables 'Disable Timeouts' mode."
    },
    "settings#egress-region#heading": {
        "message": "Regione Server Psiphon",
        "description": "Settings section heading. In this section the user can choose to use a Psiphon server in a specific country/region (or the default, which is just to choose the best/fastest region). The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#select-best-performance": {
        "message": "Best Performance",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. This is the default option and indicates that Psiphon will use a server in the best/fastest region."
    },
    "settings#egress-region#select-us": {
        "message": "Stati Uniti",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the United States will be used."
    },
    "settings#egress-region#select-ca": {
        "message": "Canada",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the Canada will be used."
    },
    "settings#egress-region#select-gb": {
        "message": "Regno Unito",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the UK will be used."
    },
    "settings#egress-region#select-jp": {
        "message": "Giappone",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Japan will be used."
    },
    "settings#egress-region#select-sg": {
        "message": "Singapore",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Singapore will be used."
    },
    "settings#egress-region#select-sk": {
        "message": "Slovacchia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Slovakia will be used."
    },
    "settings#egress-region#select-nl": {
        "message": "Olanda",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the Netherlands will be used."
    },
    "settings#egress-region#select-de": {
        "message": "Germania",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Germany will be used."
    },
    "settings#egress-region#select-in": {
        "message": "India",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in India will be used."
    },
    "settings#egress-region#select-es": {
        "message": "Spagna",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Spain will be used."
    },
    "settings#egress-region#select-hk": {
        "message": "Hong Kong",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Hong Kong will be used."
    },
    "settings#egress-region#select-at": {
        "message": "Austria",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Austria will be used."
    },
    "settings#egress-region#select-be": {
        "message": "Belgio",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Belgium will be used."
    },
    "settings#egress-region#select-bg": {
        "message": "Bulgaria",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Bulgaria will be used."
    },
    "settings#egress-region#select-ch": {
        "message": "Svizzera",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Switzerland will be used."
    },
    "settings#egress-region#select-cz": {
        "message": "Repubblica Ceca",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Czech Republic will be used."
    },
    "settings#egress-region#select-dk": {
        "message": "Danimarca",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Denmark will be used."
    },
    "settings#egress-region#select-fr": {
        "message": "Francia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in France will be used."
    },
    "settings#egress-region#select-hu": {
        "message": "Ungheria",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Hungary will be used."
    },
    "settings#egress-region#select-it": {
        "message": "Italia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Italy will be used."
    },
    "settings#egress-region#select-no": {
        "message": "Norvegia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Norway will be used."
    },
    "settings#egress-region#select-ro": {
        "message": "Romania",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Romania will be used."
    },
    "settings#egress-region#select-se": {
        "message": "Svezia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Sweden will be used."
    },
    "settings#egress-region#select-pl": {
        "message": "Polonia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Sweden will be used."
    },
    "settings#egress-region#select-rs": {
        "message": "Serbia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Serbia will be used."
    },
    "settings#egress-region#select-au": {
        "message": "Australia",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Australia will be used."
    },
    "settings#egress-region#description": {
        "message": "Psiphon has servers in many different countries and regions. Using a Psiphon server in a region close to your home country will generally provide a better network connection, but you may wish to access websites and services like you are virtually in a specific country or region.",
        "description": "Help text in the 'Psiphon Server Region' settings section explaining what the option is and why the user may want to override the default ('best') setting value. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#default": {
        "message": "Choosing the default <strong>“Best Performance”</strong> option allows Psiphon to automatically choose a server, which will generally result in the best network connection.",
        "description": "Help text below the 'Psiphon Server Region' combo box. It explains to the user what the default (and best) option is. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#invalid-error-msg": {
        "message": "Scegli una Regione Server Psiphon valida.",
        "description": "Error message that is visible when the 'Psiphon Server Region' setting is invalid or not yet set. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#error-modal-title": {
        "message": "Regione Server non disponibile",
        "description": "Title text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured."
    },
    "settings#egress-region#error-modal-body-http": {
        "message": "You have configured Psiphon to use a server in a specific region.<br>\nHowever, that region is no longer available.<br>\nYou must choose a new region or change to the default “Best Performance” choice.",
        "description": "Descriptive body text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#heading": {
        "message": "Porte Proxy Locale",
        "description": "Settings section heading. In this section the user can specify what network ports the local Psiphon processes should use (Psiphon uses two such ports). For most people, this should be set to automatic."
    },
    "settings#local-proxy-ports#leave-blank": {
        "message": "Lasciare in <strong>bianco</strong> per selezione automatica delle porte (raccomandato).",
        "description": "Help text that appears above the 'Local Proxy Ports' settings. 'blank' is the default and best value, and is bolded."
    },
    "settings#local-proxy-ports#reason": {
        "message": "If you use tools on your computer that require manual configuration to work with Psiphon, you will want Psiphon to consistently use the same local port numbers. If you don’t have a reason to specify port numbers, you should allow Psiphon to choose them automatically to help avoid conflicts.",
        "description": "Help text in the 'Local Proxy Ports' settings area. This explains to the user why they might want to override the default (automatic) settings values. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#http-label": {
        "message": "HTTP/HTTPS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon HTTP/HTTPS process. The full term for this would be 'Desired HTTP and HTTPS local proxy port', but is shortened."
    },
    "settings#port-value-error-msg": {
        "message": "Dev'essere compreso fra 1 e 65535",
        "description": "Error text that appears when the user enters an invalid network port number. As indicated, a valid port number must be a number between 1 and 65535, inclusive. This text is not visible until an invalid value is entered."
    },
    "settings#local-proxy-ports#socks-label": {
        "message": "SOCKS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon SOCKS process. The full term for this would be 'Desired SOCKS local proxy port', but is shortened. 'SOCKS' is a proxy protocol. Any user for whom this setting is useful will know what that means."
    },
    "settings#local-proxy-ports#unique-error-msg": {
        "message": "Local ports must be distinct from each other.",
        "description": "Error message that shows if the HTTP local proxy port and SOCKS local proxy port are set to a value and are the same as each other. The local ports must be different from each other. Or one or both of the fields can be empty, which means 'automatic selection'."
    },
    "settings#local-proxy-ports#error-modal-title": {
        "message": "Local Proxy Port Conflict",
        "description": "Title of the message box showing the error message when it is detected that the user has chosen a local proxy port (either HTTP or SOCKS) that is already in use and therefore can't be used by Psiphon."
    },
    "settings#local-proxy-ports#error-modal-body-http": {
        "message": "<p>\nYou have configured Psiphon to use a specific local port for its HTTP proxy.<br>\nHowever, that port appears to be already in use and so Psiphon cannot use it.\n</p>\n<p>\nPlease change the configured HTTP proxy port value and try again. We recommended that you clear the value so that Psiphon can automatically pick an available port.\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the HTTP proxy port, rather than the SOCKS proxy port. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#error-modal-body-socks": {
        "message": "<p>\nYou have configured Psiphon to use a specific local port for its SOCKS proxy.<br>\nHowever, that port appears to be already in use and so Psiphon cannot use it.\n</p>\n<p>\nPlease change the configured SOCKS proxy port value and try again. We recommended that you clear the value so that Psiphon can automatically pick an available port.\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the SOCKS proxy port, rather than the HTTP proxy port. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#expose-local-proxies-to-lan#help-text": {
        "message": "If you have other devices on your network, such as a smart TV or gaming console, you can allow them to use these HTTP and SOCKS proxies while Psiphon is connected.",
        "description": "Help text explaining the setting to allow other devices on the network to use the local Psiphon proxies. Smart TV refers to televisions that have Internet connectivity and apps that access Internet services."
    },
    "settings#expose-local-proxies-to-lan#hint": {
        "message": "<strong>HINT:</strong> You should specify at least one of the port numbers above in order to use this feature. The addresses of the local proxies will be displayed in the logs.",
        "description": "Helpful hint suggesting to set port numbers for the local Psiphon proxies when using the setting to allow other devices on the network to use the local Psiphon proxies."
    },
    "settings#expose-local-proxies-to-lan#enable-label": {
        "message": "Allow other devices on your network to use the local Psiphon proxies",
        "description": "Label for the setting to allow other devices on the network to use the local Psiphon proxies."
    },
    "settings#upstream-proxy#heading": {
        "message": "Proxy di transito",
        "description": "Settings section heading. In this section the user can specify network information to use an 'upstream proxy', which is a separate proxy that Psiphon will connect through to get to its own server. This is most often used by people in school or work networks that force them to connect out to the Internet through a particular server. This setting can also disable automatic upstream proxy use."
    },
    "settings#upstream-proxy#by-default": {
        "message": "Se il tuo computer ha un proxy configurato, di norma Psiphon utilizza quel proxy per connettere i tunnel. Puoi cambiare questo comportamento specificando un proxy diverso, o specificando di non utilizzare il proxy configurato.",
        "description": "Help text indicating the default (and best) configuration and behavior for the 'Upstream Proxy' setting. It also indicates what will happen if the setting is overridden or disabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#upstream-proxy#reason": {
        "message": "Upstream proxies are sometimes required by schools, universities, or businesses. If your network provider has given you upstream proxy settings, then manually setting them here may be required to connect.",
        "description": "Help text describing why the user might need to modify the upstream proxy settings in order to successfully connect to the Psiphon server."
    },
    "settings#upstream-proxy#proxy-reqs": {
        "message": "Only HTTP proxies that support HTTPS are allowed.",
        "description": "Help text beside the upstream proxy settings indicating what type of upstream proxies can by used by Psiphon (different proxies are of different types and have different capabilities, and Psiphon has certain requirements)."
    },
    "settings#upstream-proxy#hostname-label": {
        "message": "Nome host",
        "description": "Label for the text box where the user can set the hostname for the 'upstream proxy'. 'Hostname' means approximately the same thing as 'server network name or identifier'."
    },
    "settings#upstream-proxy#port-label": {
        "message": "Porta",
        "description": "Label for the text box where the user can set the network port number for the 'upstream proxy' that they would like to use."
    },
    "settings#upstream-proxy#username-label": {
        "message": "Nome utente",
        "description": "Label for the text box where the user can set the username for the 'upstream proxy'."
    },
    "settings#upstream-proxy#password-label": {
        "message": "Password",
        "description": "Label for the text box where the user can set the password for the 'upstream proxy'."
    },
    "settings#upstream-proxy#domain-label": {
        "message": "Dominio",
        "description": "Label for the text box where the user can set the domain for the 'upstream proxy'."
    },
    "settings#upstream-proxy#skip-label": {
        "message": "Non usare il proxy di transito",
        "description": "Label for the checkbox that allows the user to override the default 'upstream proxy' usage and totally disable the feature."
    },
    "settings#upstream-proxy#set-hostname-error-msg": {
        "message": "You must provide a Hostname, or leave all Upstream Proxy fields blank for automatic selection.",
        "description": "Error message that is shown if the user enters a value for one of the other upstream proxy fields but not for 'hostname', which is required. Alternatively, the user can leave all fields blank to allow the automatic behaviour."
    },
    "settings#upstream-proxy#set-username-error-msg": {
        "message": "You must provide a Username if you are setting Password or Domain; or leave all authentication fields blank for no authentication.",
        "description": "Error message that is shown if the user enters a value for one of 'Password' or 'Domain', but does not provide a 'Username' -- this is not valid, as username is are required. Alternatively, the user can leave all authentication fields blank to use an upstream proxy which doesn't require authentication."
    },
    "settings#upstream-proxy#error-modal-title": {
        "message": "Upstream Proxy Error",
        "description": "Title of the message box showing the error message when a problem is detected with the user's 'upstream proxy settings'."
    },
    "settings#upstream-proxy#error-modal-body-default": {
        "message": "Psiphon is currently configured to use your system proxy as its “upstream proxy”.<br>\nHowever, we seem to be unable to connect to a Psiphon server through that proxy.<br>\nPlease enable “Don't use upstream proxy” and try again.",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has not directly altered these settings (yet), but the default is causing a problem. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#upstream-proxy#error-modal-body-configured": {
        "message": "You have configured Psiphon to use an “upstream proxy”.<br>\nHowever, we seem to be unable to connect to a Psiphon server through that proxy.<br>\nPlease fix the settings and try again.",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has directly altered these settings, and those settings are (probably) erroneous. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#transport-mode#heading": {
        "message": "Tipo VPN",
        "description": "Settings section heading. In this section the user can choose to use an alternative connection and data transfer method -- also known as 'transport'."
    },
    "settings#transport-mode#check-label": {
        "message": "Usa L2TP/IPSec",
        "description": "Label for the checkbox that allows the user to indicate that they want to use the non-default network transport mode. This mode is generally inferior for circumvention and not recommended. 'L2TP/IPSec' is the technical name for a type of virtual private network and should probably not be translated."
    },
    "settings#transport-mode#help-text": {
        "message": "Uses Windows L2TP/IPSec virtual networking. This mode will tunnel all of your apps, but it doesn’t provide obfuscation and so does not have strong censorship circumvention capabilities. It is <strong>not recommended</strong> for bypassing most firewalls.",
        "description": "Help text for the 'Use L2TP/IPSec mode' transport selection checkbox. It gives some technical details and indicates that this mode is not recommended."
    },
    "settings#systray-minimize#heading": {
        "message": "Minimize to Notification Area (System Tray)",
        "description": "Settings section heading. In this section the user can choose to enable or disable the ability for the Psiphon application window to be hidden as a notification area icon when minimized. 'Notification area' is the official term for the icons located near the clock on the Windows taskbar, but it's also often called the 'system tray' or 'systray' -- use whatever is most common in your language, and be verbose if necessary."
    },
    "settings#systray-minimize#help-text": {
        "message": "If enabled, when minimized the Psiphon application window will hide in the notification area (also known as the “system tray” or “systray”, located near the clock on your Windows task bar).",
        "description": "Text explaining to the user what the 'Minimize to Notification Area (System Tray)' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#systray-minimize#reason": {
        "message": "Minimizing Psiphon to the notification area (“system tray”) frees up space on your task bar. This is especially helpful if you often run Psiphon for long periods of time.",
        "description": "Help text in the 'Minimize to Systray' settings section explaining to the user why they might want to enable it. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#systray-minimize#enable-label": {
        "message": "Minimize to the notification area (system tray)",
        "description": "The label on the checkbox that enables 'Minimize to Notification Area (System Tray)'."
    },
    "settings#applying-message": {
        "message": "Reconnecting to apply your settings.",
        "description": "Pop-up message shown to users after they have changed their settings and a reconnection is happening to apply the new settings."
    },
    "settings#saved-message": {
        "message": "Impostazioni salvate.",
        "description": "Pop-up message shown to users after they have changed their settings (but they aren't currently connected, so there's no reconnect or further action)."
    },
    "settings#error-modal#title": {
        "message": "Errore nelle impostazioni",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This string is the title of the modal box."
    },
    "settings#error-modal#body": {
        "message": "There are errors in your settings values. Please correct them before proceeding.",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This body is the title of the modal box."
    },
    "feedback#top_content_title": {
        "message": "Inviaci il Tuo Feedback",
        "description": "Title for the Feedback page"
    },
    "feedback#top_para_2": {
        "message": "Molti problemi sono risolvibili aggiornando all'ultima versione.  Puoi <a class=\"NewVersionURL\" href=\"#\">ottenere l'ultima versione cliccando qui</a>, oppure inviando un'email a <a class=\"NewVersionEmail\" href=\"#\"></a>.",
        "description": "Text telling the user that downloading a new version of Psiphon may be beneficial, and how to get a new version."
    },
    "feedback#top_para_3": {
        "message": "Inoltre è possibile trovare soluzioni a problemi comuni nelle nostre <a class=\"FaqURL\" href=\"#\">Domande Frequenti</a>.",
        "description": "Text telling the user how to get to the Psiphon FAQ."
    },
    "feedback#smiley_happy": {
        "message": "Psiphon si collega e opera correttamente.",
        "description": "The text below the 'happy face' feedback choice. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#smiley_sad": {
        "message": "Psiphon spesso non si connette o non funziona abbastanza bene.",
        "description": "The text below the 'sad face' feedback choice. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#text_feedback_prompt": {
        "message": "Inserisci i tuoi commenti quì:",
        "description": "Label for a text box where the user can provide a feedback message to Psiphon Inc."
    },
    "feedback#text_feedback_email_prompt": {
        "message": "Se desideri una risposta, inserisci il tuo indirizzo email:",
        "description": "Label for a text field where the user can provide an email address to Psiphon Inc. along with their feedback."
    },
    "feedback#diagnostic_check": {
        "message": "Caricare dati diagnostici. Si osservi che questi dati diagnostici non identificano l'utente e ci aiuteranno a garantire il corretto funzionamento di Psiphon. <a class=\"DataCollectionInfoURL\" href=\"#\">Clicca qui per vedere i dati raccolti</a>.",
        "description": "Checkbox text. If it is checked, diagnostic information about Psiphon's status will be sent along with the feedback to Psiphon Inc. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#submit_button": {
        "message": "Invia",
        "description": "Submit button text. If the user clicks it, their feedback will be sent to Psiphon Inc."
    },
    "feedback#text_feedback_bottom_para": {
        "message": "Se il modulo precedente non funziona, o vuoi trasmettere degli screenshot, inviaci un'e-mail all'indirizzo <a id=\"FeedbackEmailAddress\" href=\"mailto:feedback@psiphon.ca\">feedback@psiphon.ca</a>.",
        "description": "Message showing the user an email they can use to contact Psiphon Inc."
    },
    "feedback#success-message": {
        "message": "<strong>Grazie!</strong> Il tuo feedback è stato inviato.",
        "description": "Message shown to user after their feedback has been sent successufully"
    },
    "logs#show-debug-label": {
        "message": "Mostra registrazioni di debug",
        "description": "Label on a checkbox. If the user checks it, debug log messages will be shown to the user."
    },
    "logs#placeholder": {
        "message": "Nessuna registrazione ancora",
        "description": "Placeholder text shown when there are not yet any log messages to show. This message is removed when the first log message is added."
    },
    "language#success-message": {
        "message": "<strong>Salve!</strong> Benvenuto su Psiphon.",
        "description": "A welcome message shown to the user when they first switch to the correct UI language. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#wordart-tag": {
        "message": "Oltre i Confini",
        "description": "The application/product/tool tagline/slogan/motto part of the fancy title at the top of the 'About' page. 'Beyond Borders' is the slogan that is also used on the Psiphon website -- it is meant to suggest that Psiphon can help users to get to the internet beyond the border (firewall) of the country they live in. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#description": {
        "message": "Psiphon is a <strong>censorship circumvention tool</strong> — it is designed to give access to the open Internet, past censors and firewalls. It is <strong>open source</strong> and developed in Toronto, Canada.",
        "description": "Paragraph on the 'About' page telling users generally what Psiphon is. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#visit-download-site": {
        "message": "Please visit the website to <strong><a class=\"NewVersionURL\" href=\"#\">download a new version</a></strong> or to <strong><a class=\"InfoURL\" href=\"#\">get help and information</a></strong>. Psiphon is available for Android and Windows.",
        "description": "Paragraph on the 'About' page telling users what web page to go to get a new version of Psiphon or more info about it. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#get-by-email": {
        "message": "<strong>If the website is inaccessible</strong>, you can get a new version of Psiphon by sending an email to:",
        "description": "Paragraph on the 'About' page telling users that they can also get a new version of Psiphon via email. The text in this resource is then followed by an email address. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#client-version": {
        "message": "Psiphon per Windows versione client:",
        "description": "Footer on the 'About' page indicating the client version number. This text is the prefix to the actual number. Like: 'Psiphon for Windows client version: 88'. The word 'Psiphon' must not be translated or transliterated."
    },
    "general#modal-close-button": {
        "message": "Chiudi",
        "description": "Text in the button that dismisses a modal dialog. It is often the only button (no 'OK' or 'Cancel', etc.)."
    },
    "general#notice-modal-tech-preamble": {
        "message": "Here is the technical error info:",
        "description": "Preamble before the technical message relating to the error being shown. This is generated within the code and may not be very user-friendly (but it may be necessary for the user to figure out what's wrong)."
    },
    "notice#systemproxysettings-setproxy-error-title": {
        "message": "Errore del proxy di sistema",
        "description": "Title of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon."
    },
    "notice#systemproxysettings-setproxy-error-body": {
        "message": "<p>Psiphon failed to set the system’s proxy settings.</p>\n<p>This might be due to a conflict with your antivirus software. You might need to manually configure your application or system proxy settings to use the local Psiphon proxies.</p>",
        "description": "Body text of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon. The word 'Psiphon' must not be translated or transliterated."
    },
    "notice#systemproxysettings-setproxy-warning-template": {
        "message": "Psiphon failed to set the system’s proxy settings for the Internet connection named “<%- data %>”. This might be due to a conflict with your antivirus software. You might need to manually configure your application or system proxy settings to use the local Psiphon proxies.",
        "description": "'<%- data %>' is a placeholder and must not be modified. Log message emitted when Psiphon can't fully configure the system to use Psiphon. It may or may not be a fatal state, and may or may not need human intervention. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-stopped-title": {
        "message": "Psiphon è disconnesso",
        "description": "Appears in the notification area balloon when Psiphon is disconnected (or has lost its connection, or has been disconnected). The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-starting-title": {
        "message": "Psiphon stà connettendosi",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-starting-body": {
        "message": "Attendere…",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-title": {
        "message": "Psiphon è connesso",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-body": {
        "message": "Explore beyond your borders!",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed. This is intended to be a reference to the 'Psiphon: Beyond Borders' tag line. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system."
    },
    "appbackend#state-connected-reminder-title": {
        "message": "Psiphon is keeping you connected",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-reminder-body": {
        "message": "Keep Psiphon free. Click here to visit our sponsor pages!",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. This is intended to encourage the user to visit the sponsor's landing page. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-reminder-body-2": {
        "message": "Keep Psiphon free by visiting our sponsor pages!",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. This is intended to encourage the user to visit the sponsor's landing page. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#minimized-to-systray-title": {
        "message": "Psiphon has been minimized to the notification area",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons). The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#minimized-to-systray-body": {
        "message": "Click the icon to restore the application",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons)."
    },
    "appbackend#os-unsupported": {
        "message": "Psiphon no longer supports Windows XP or Vista.\nPlease visit our website for more information.",
        "description": "Appears in a message box when Psiphon is run on an unsuppoted version of Windows. Is followed by a URL."
    },
    "psicash#transaction-error-title": {
        "message": "PsiCash transaction error",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-error-body": {
        "message": "Your PsiCash transaction attempt failed unexpectedly.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ExistingTransaction-title": {
        "message": "PsiCash purchase already exists",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ExistingTransaction-body": {
        "message": "You have an existing PsiCash purchase of this type. Another purchase of this type is not allowed until the previous one expires. Your PsiCash state will be refreshed now.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InsufficientBalance-title": {
        "message": "Insufficient PsiCash balance",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The user doesn't have enough PsiCash to make the attempted purchase. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InsufficientBalance-body": {
        "message": "You do not have sufficient PsiCash balance for this purchase.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The user doesn't have enough PsiCash to make the attempted purchase. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionAmountMismatch-title": {
        "message": "PsiCash purchase price mismatch",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionAmountMismatch-body": {
        "message": "PsiCash purchase prices are out-of-date. Your PsiCash state will be refreshed now.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionTypeNotFound-title": {
        "message": "PsiCash purchase type not found",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionTypeNotFound-body": {
        "message": "The product you are trying to buy no longer exists. You may need to update or reinstall the application.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InvalidTokens-title": {
        "message": "Invalid PsiCash tokens",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InvalidTokens-body": {
        "message": "Your PsiCash tokens are invalid. Try restarting the application. If that doesn't work, you will need to <a href=\"https://psiphon3.com/faq.html#clear-windows-data\">clear your local storage</a>.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ServerError-title": {
        "message": "PsiCash server error",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ServerError-body": {
        "message": "The PsiCash server responded with an error while trying to make the purchase. Please retry your purchase later.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-speedboost-active": {
        "message": "Speed&nbsp;Boost active for %s",
        "description": "When the user has Speed Boost active, this shows them how much time they have remaining. '%s' is like 'an hour' or '30 minutes' (localized). This text will be shown on a narrow button that should have at most 3 lines. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#ui-zerobalance-title": {
        "message": "Need a Speed&nbsp;Boost?",
        "description": "When the user has no PsiCash available, this message will be shown on the disabled 'Buy Speed Boost' button. This text will be shown on a narrow button that should have at most 3 lines. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#ui-buypsi": {
        "message": "Buy PsiCash",
        "description": "Label for a button/link that opens a store web page were users can spend money to buy PsiCash. At this point, the user has no PsiCash at all. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-buymorepsi": {
        "message": "Buy more PsiCash",
        "description": "Label for a button/link that opens a store web page were users can spend money to buy PsiCash. At this point, the user already has some PsiCash, but may wish to buy more. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-nsfbalance-buttontext": {
        "message": "Needed for Speed&nbsp;Boost",
        "description": "Label on a disabled button, followed by a value in PsiCash indicating how much it costs to buy an hour of Speed Boost. When the user has enough PsiCash, the button will be enabled and the text will change. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#ui-enoughbalance-buttontext": {
        "message": "Start Speed&nbsp;Boost",
        "description": "Label on a button. The text is followed by a value in PsiCash indicating how much it costs to buy an hour of Speed Boost. Clicking the button will buy an hour of Speed Boost. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#1-hour": {
        "message": "1 ora",
        "description": "Label on a button. Clicking this button will buy 1 hour of speed boost."
    },
    "psicash#1-day": {
        "message": "1 giorno",
        "description": "Label on a button. Clicking this button will buy 1 day (24 hours) of speed boost."
    },
    "psicash#ui-buyingboost-buttontext": {
        "message": "Starting Speed&nbsp;Boost!",
        "description": "Label for a disabled button. The user has clicked the button in order to buy an hour of Speed Boost, and now the purchase is completing and Speed Boost is activating. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "positive-value-indicator": {
        "message": "+%d",
        "description": "This is used to indicate when a numeric value is positive -- like '+500'. This will show when a number is going to be increased by another number. '%d' is a placeholder for an integer for decimal value."
    },
    "psicash#mustconnect-modal#title": {
        "message": "Psiphon Connection Required",
        "description": "Title text of a modal dialog shown when the user tries to use (spend, buy, etc.) PsiCash, if they not currently connected. 'Psiphon' must not be translated/transliterated."
    },
    "psicash#mustconnect-modal#body": {
        "message": "In order to use PsiCash, you must be connected to the Psiphon network.",
        "description": "Body text of a modal dialog shown when the user tries to use (spend, buy, etc.) PsiCash, if they not currently connected. 'Use' here means buy, spend, or otherwise interact with. 'Psiphon' must not be translated/transliterated. 'PsiCash' must not be translated/transliterated."
    },
    "psicash#init-error-title": {
        "message": "PsiCash initialization error",
        "description": "Title of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#init-error-body-unrecovered": {
        "message": "PsiCash failed to initialize. This is probably due to a file system problem, such as being out of disk space. Your balance and other state have been lost. PsiCash will not be usable. You can try restarting the application to recover from the problem.",
        "description": "Body text of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#init-error-body-recovered": {
        "message": "PsiCash failed to initialize. This is probably due to a file system problem, such as being out of disk space. Your balance and other state have been reset.",
        "description": "Body text of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#psiphon-speed": {
        "message": "Psiphon<br>Speed",
        "description": "Text on a badge next to an image or gauge that will indicate 'fast' or 'slow'. This is the current Psiphon tunnel speed limit. Speed Boost is required in order to get the fastest speed. The word 'Psiphon' must not be translated or transliterated. The word 'Psiphon' can be dropped if necessary to get a meaning like 'speed limit'. This text must be kept narrow and short -- only two or three lines of one or two words each. Use hard breaks (like <br>) to separate lines (perhaps with hyphens), and soft break indicators (like &shy; or <wbr> or &#8203;) to indicate were long words can be broken."
    },
    "notice#disallowed-traffic-alert-title": {
        "message": "Upgrade your Psiphon connection",
        "description": "Title of modal error message shown to user when Psiphon disallows some non-web internet traffic. The user will be told to 'upgrade' their connection with Speed Boost (giving more speed and app compatibility). The word 'Psiphon' must not be translated or transliterated."
    },
    "notice#disallowed-traffic-alert-body": {
        "message": "<p>Apps not working?</p>\n<p>Some internet traffic is not supported without an active Speed Boost. Activate Speed Boost with PsiCash to unlock the full potential of your Psiphon experience.</p>",
        "description": "Body text of modal error message shown to user when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed. The words 'Psiphon' and 'PsiCash' must not be translated or transliterated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "appbackend#disallowed-traffic-notification-title": {
        "message": "Apps not working?",
        "description": "Appears in the notification area balloon when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed."
    },
    "appbackend#disallowed-traffic-notification-body": {
        "message": "Activate Speed Boost to unlock the full potential of your Psiphon experience.",
        "description": "Appears in the notification area balloon when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "settings#disallowed-traffic-alert#heading": {
        "message": "Disallowed Traffic Alert",
        "description": "Settings section heading. In this section the user can choose to enable or disable alerts telling the user when app traffic has been disallowed and they need to get Speed Boost."
    },
    "settings#disallowed-traffic-alert#help-text": {
        "message": "Some types of internet traffic are not supported without an active Speed Boost. When such traffic is disallowed, an alert is shown. (Re-enabling will require a reconnection.)",
        "description": "Text explaining to the user what the 'Disallowed Traffic Alert' setting does if enabled. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "settings#disallowed-traffic-alert#disable-label": {
        "message": "Disable disallowed traffic alerts",
        "description": "The label on the checkbox that disables the 'Disallowed Traffic Alert'."
    },
    "banner#sponsored-by": {
        "message": "Sponsorizzato da",
        "description": "Text appears above the sponsor banner image. So it kind of reads 'Sponsored by BBC' (for example)."
    }
}