{
    "banner#long-connecting": {
        "message": "<strong>Waheý</strong> Birikmekde näsazlyk çykýar!<br>\nPsiphon-yň iň soňky görnüşini  <a class=\"NewVersionURL\" href=\"#\">şu saýtdan indir</a>\nýada email ugrat <a class=\"NewVersionEmail\" href=\"#\"></a>",
        "description": "Message that appears when Psiphon is having trouble connecting. Often such connection problems can be fixed by downloading a new version. The word 'Psiphon' must not be translated or transliterated."
    },
    "nav#connection#starting": {
        "message": "Birikdirilýär...",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connecting."
    },
    "nav#connection#connected": {
        "message": "Birikdirildi",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is connected."
    },
    "nav#connection#stopping": {
        "message": "Birikmeýär",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnecting."
    },
    "nav#connection#stopped": {
        "message": "Birikmedi",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Connection' view, that has the connect button. This particular text is shown when Psiphon is disconnected."
    },
    "nav#settings": {
        "message": "Sazlamalar",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Settings' view. In that view the user can change the settings/options that change how Psiphon works."
    },
    "nav#feedback": {
        "message": "Seslenme",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Feeback' view. In that view the user can send feedback about their experience to Psiphon."
    },
    "nav#logs": {
        "message": "Ýazgylar",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'Logs' view. In that view the user can see the status messages that Psiphon produces as it connects, disconnects, etc."
    },
    "nav#about": {
        "message": "Hakynda",
        "description": "Text on the tab that, if the user clicks on it, switches to the 'About' view. In that view the user can see info about the app, info about Psiphon Inc., and click links for more information."
    },
    "connection#starting-msg": {
        "message": "Psiphon <span class=\"state-word\"> birikýär</span>…",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to connect to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#stop-btn": {
        "message": "Dur",
        "description": "Text on the big connection button telling the user that if they click it, they will stop trying to connect to the network. This is shown to the user when they are trying to connect."
    },
    "connection#connected-msg": {
        "message": "Psiphon<span class=\"state-word\">birikdi </span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently connected to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#disconnect-btn": {
        "message": "Birikme",
        "description": "Text on the big connection button telling the user that if they click it, they will be disconnected from the network. This is shown when the user is currently connected."
    },
    "connection#stopping-msg": {
        "message": "Psiphon <span class=\"state-word\"> birikdirilenok</span>…",
        "description": "Message in the big connection status box telling the user that Psiphon is currently trying to disconnect from the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#wait-btn": {
        "message": "Garaşyň",
        "description": "Text on the big connection button telling the user to wait while Psiphon tries to disconnect from the network. When this message is shown, the button is disabled."
    },
    "connection#stopped-msg": {
        "message": "Psiphon <span class=\"state-word\">birikmedi </span>",
        "description": "Message in the big connection status box telling the user that Psiphon is currently not connected to the network. The word 'Psiphon' must not be translated or transliterated."
    },
    "connection#connect-btn": {
        "message": "Birikdirildi",
        "description": "Text on the big connection button telling the user that if they click it, Psiphon will start trying to connect to the network. This is shown to the user while Psiphon is disconnected."
    },
    "connection#egress-region-combo-label": {
        "message": "Select server region",
        "description": "The label for the 'Psiphon Server Region' combo box control located on the connection tab."
    },
    "settings#error-alert": {
        "message": "<strong>Säwlik!</strong> Hayyş, dowam etmekden öñ nädogry bellikleri düzediñ.",
        "description": "This alert is shown to the user if they enter incorrect values into one or more of the settings fields."
    },
    "settings#reset-button": {
        "message": "Täzeden asyla dolan",
        "description": "Text on the button that resets the Psiphon settings values to default. This will typically be pressed if the user has configured something incorrectly and needs to get back to the default state."
    },
    "settings#apply-button": {
        "message": "üýtgetmeleri ulan",
        "description": "Text on the button that applies (saves and makes active) the changes that the user has made to their settings. It is only enabled when changes have been made. The text is effectively an abbreviation of 'Apply the changes you have made to your settings'."
    },
    "settings#unapplied-changes-prompt#title": {
        "message": "Sazlamalar Üýtgedildi",
        "description": "Title of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#unapplied-changes-prompt#body": {
        "message": "Siz sazlamalarda üytgeşmeler edipsiñiz, ýöne ol üytgeşmeleri ulanmansyñyz.<br><br>Siz üytgeşmeleri şu wagt ulanmakçy my ýa-da ret et?",
        "description": "Body text of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes."
    },
    "settings#unapplied-changes-prompt#apply-button": {
        "message": "Ulan",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will apply the changes -- that is, save the changes and make them immediately take effect. Should be read like the verb in 'Apply your changes'."
    },
    "settings#unapplied-changes-prompt#discard-button": {
        "message": "Ret et",
        "description": "Text on a button of the modal dialog box that appears when the user has modified their changes, but has not applied the changes before trying to navigate to another tab. At that time the user is propmted with the choice to apply or discard the changes. This button will discard the changes -- that is, throw away the changes to the settings the user has made since viewing the settings tab.  Should be read like the verb in 'Discard your changes'."
    },
    "settings#vpn-incompatible-msg": {
        "message": "(L2TP/IPSec ülñi bilen išlänok.)",
        "description": "If 'L2TP/IPSec mode' is enabled, this text is displayed under or beside settings which are incompatible with L2TP/IPSec mode and have been disabled because of it. It is intended to let the user know why the setting has been disabled."
    },
    "settings#vpn-incompatible-label": {
        "message": "L2TP/IPSec",
        "description": "If 'L2TP/IPSec mode' is enabled, this text shows up in a label beside the Settings sections which are incompatible with L2TP/IPSec mode. It is intended to draw the user's attention to the fact that some of the other settings have become disabled."
    },
    "settings#split-tunnel#heading": {
        "message": "Ötük bölündi",
        "description": "Settings section heading. If the user clicks this, the 'Split Tunnel' section will expand and can be edited. If 'split tunnel' is enabled, if the user is trying to get to a website in his/her own country, they will connect to it directly, instead of through Psiphon."
    },
    "settings#split-tunnel#help-text": {
        "message": "If enabled, requests made to servers within your home country will not be tunneled through Psiphon.",
        "description": "Text explaining to the user what the 'Split Tunnel' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#split-tunnel#reason": {
        "message": "Websites within your home country are generally not blocked, so enabling this option will give you faster access to those sites and can sometimes reduce ISP data usage costs.",
        "description": "Help text in the 'Split Tunnel' settings section explaining to the user why they might want to modify (enable) the setting."
    },
    "settings#split-tunnel#enable-label": {
        "message": "Öz ýurduňyzdaky websaýtlary proksileme.",
        "description": "The label on the checkbox that enables 'Split Tunnel'."
    },
    "settings#disable-timeouts#heading": {
        "message": "Yuwaş network üçin goşmaça wagtalmalary öçür ",
        "description": "Settings section heading. If the user clicks this, the 'Disable Timeouts for Slow Networks' section will expand and can be edited. If 'disable timeouts' is enabled, network timeouts between the Psiphon client and server will be disabled."
    },
    "settings#disable-timeouts#help-text": {
        "message": "Işledilen halatynda, Psiphon serwer baglanşygy wagtdan geçmez.",
        "description": "Text explaining to the user what the 'Disable Timeouts' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#disable-timeouts#reason": {
        "message": "When enabling this for a very slow network connection, you are less likely to experience unexpected disconnections.",
        "description": "Help text in the 'Disable Timeouts' settings section explaining to the user why they might want to modify (enable) the setting."
    },
    "settings#disable-timeouts#enable-label": {
        "message": "Yuwaş network halatynda goşmaça wagtalmalary öçür ",
        "description": "The label on the checkbox that enables 'Disable Timeouts' mode."
    },
    "settings#egress-region#heading": {
        "message": "Psiphon Serwer Ýurdy",
        "description": "Settings section heading. In this section the user can choose to use a Psiphon server in a specific country/region (or the default, which is just to choose the best/fastest region). The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#select-best-performance": {
        "message": "Ýokary hilli işleýişi",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. This is the default option and indicates that Psiphon will use a server in the best/fastest region."
    },
    "settings#egress-region#select-us": {
        "message": "Amerikaň Birleşen Ştatlary",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the United States will be used."
    },
    "settings#egress-region#select-ca": {
        "message": "Kanada",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the Canada will be used."
    },
    "settings#egress-region#select-gb": {
        "message": "Beýik Britaniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the UK will be used."
    },
    "settings#egress-region#select-jp": {
        "message": "Ýaponiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Japan will be used."
    },
    "settings#egress-region#select-sg": {
        "message": "Singapur",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Singapore will be used."
    },
    "settings#egress-region#select-sk": {
        "message": "Slowakiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Slovakia will be used."
    },
    "settings#egress-region#select-nl": {
        "message": "Gollandiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in the Netherlands will be used."
    },
    "settings#egress-region#select-de": {
        "message": "Germaniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Germany will be used."
    },
    "settings#egress-region#select-in": {
        "message": "Hindistan",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in India will be used."
    },
    "settings#egress-region#select-es": {
        "message": "Ispaniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Spain will be used."
    },
    "settings#egress-region#select-hk": {
        "message": "Gong Kong",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Hong Kong will be used."
    },
    "settings#egress-region#select-at": {
        "message": "Awstriýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Austria will be used."
    },
    "settings#egress-region#select-be": {
        "message": "Belgiya",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Belgium will be used."
    },
    "settings#egress-region#select-bg": {
        "message": "Bolgariýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Bulgaria will be used."
    },
    "settings#egress-region#select-ch": {
        "message": "Şweýsariýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Switzerland will be used."
    },
    "settings#egress-region#select-cz": {
        "message": "Çeh Respublikasy",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Czech Republic will be used."
    },
    "settings#egress-region#select-dk": {
        "message": "Daniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Denmark will be used."
    },
    "settings#egress-region#select-fr": {
        "message": "Fransiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in France will be used."
    },
    "settings#egress-region#select-hu": {
        "message": "Wengriýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Hungary will be used."
    },
    "settings#egress-region#select-it": {
        "message": "Italiya",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Italy will be used."
    },
    "settings#egress-region#select-no": {
        "message": "Norwegiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Norway will be used."
    },
    "settings#egress-region#select-ro": {
        "message": "Rumyniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Romania will be used."
    },
    "settings#egress-region#select-se": {
        "message": "Şwesiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Sweden will be used."
    },
    "settings#egress-region#select-pl": {
        "message": "Olonya",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Sweden will be used."
    },
    "settings#egress-region#select-rs": {
        "message": "Serbiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Serbia will be used."
    },
    "settings#egress-region#select-au": {
        "message": "Awstraliýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Australia will be used."
    },
    "settings#egress-region#select-ar": {
        "message": "Argentina",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Argentina will be used."
    },
    "settings#egress-region#select-br": {
        "message": "Braziliýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Brazil will be used."
    },
    "settings#egress-region#select-cl": {
        "message": "Çili",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Chile will be used."
    },
    "settings#egress-region#select-fi": {
        "message": "Finlýandiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Finland will be used."
    },
    "settings#egress-region#select-is": {
        "message": "Islandiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Iceland will be used."
    },
    "settings#egress-region#select-ie": {
        "message": "Irlandiýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Ireland will be used."
    },
    "settings#egress-region#select-ke": {
        "message": "Keniýa",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Kenya will be used."
    },
    "settings#egress-region#select-mx": {
        "message": "Meksika",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Mexico will be used."
    },
    "settings#egress-region#select-za": {
        "message": "Günorta Afrika",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in South Africa will be used."
    },
    "settings#egress-region#select-kr": {
        "message": "Korea",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Korea will be used."
    },
    "settings#egress-region#select-tw": {
        "message": "Taýwan",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in Taiwan will be used."
    },
    "settings#egress-region#select-ae": {
        "message": "Birleşen Arap Emirlikleri",
        "description": "One of the choices in the 'Psiphon Server Region' combo box. If selected, a Psiphon server in United Arab Emirates will be used."
    },
    "settings#egress-region#description": {
        "message": "Psiphon has servers in many different countries and regions. Using a Psiphon server in a region close to your home country will generally provide a better network connection, but you may wish to access websites and services like you are virtually in a specific country or region.",
        "description": "Help text in the 'Psiphon Server Region' settings section explaining what the option is and why the user may want to override the default ('best') setting value. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#default": {
        "message": "Choosing the default <strong>“Best Performance”</strong> option allows Psiphon to automatically choose a server, which will generally result in the best network connection.",
        "description": "Help text below the 'Psiphon Server Region' combo box. It explains to the user what the default (and best) option is. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#invalid-error-msg": {
        "message": "Ÿörgünli Psiphon serwer yurduny ulan.",
        "description": "Error message that is visible when the 'Psiphon Server Region' setting is invalid or not yet set. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#egress-region#error-modal-title": {
        "message": "Serweriň Ýurdy elýeterli däl",
        "description": "Title text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured."
    },
    "settings#egress-region#error-modal-body-http": {
        "message": "You have configured Psiphon to use a server in a specific region.<br>\nHowever, that region is no longer available.<br>\nYou must choose a new region or change to the default “Best Performance” choice.",
        "description": "Descriptive body text of the error modal dialog shown when it is detected that the user has an invalid 'Psiphon Server Region' currently configured. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#heading": {
        "message": "Yerli Proksi portlary",
        "description": "Settings section heading. In this section the user can specify what network ports the local Psiphon processes should use (Psiphon uses two such ports). For most people, this should be set to automatic."
    },
    "settings#local-proxy-ports#leave-blank": {
        "message": "Automatiki port saýlawy üçin<strong>boş</strong> goýmak (maslahat berilýär).",
        "description": "Help text that appears above the 'Local Proxy Ports' settings. 'blank' is the default and best value, and is bolded."
    },
    "settings#local-proxy-ports#reason": {
        "message": "Kompýuteriňizde elde düzediş talap edýän serişdeleri Psiphon bilen ulanýan bolsaňyz, onda ýerli birmeňzeş Psiphon port nomerlerini ulanmagy isläp bilersiňiz. Eger port nomerlerini görkezmek islemeýän bolsaňyz we näsazlyklaryň öňüni almak üçin Psiphona automatik port nomerlerini saýlamana rugsat beriň.",
        "description": "Help text in the 'Local Proxy Ports' settings area. This explains to the user why they might want to override the default (automatic) settings values. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#http-label": {
        "message": "HTTP/HTTPS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon HTTP/HTTPS process. The full term for this would be 'Desired HTTP and HTTPS local proxy port', but is shortened."
    },
    "settings#port-value-error-msg": {
        "message": "1 bilen 65535 aralygynda bolmaly",
        "description": "Error text that appears when the user enters an invalid network port number. As indicated, a valid port number must be a number between 1 and 65535, inclusive. This text is not visible until an invalid value is entered."
    },
    "settings#local-proxy-ports#socks-label": {
        "message": "SOCKS",
        "description": "Label for the text box where the user will enter their desired local port for the Psiphon SOCKS process. The full term for this would be 'Desired SOCKS local proxy port', but is shortened. 'SOCKS' is a proxy protocol. Any user for whom this setting is useful will know what that means."
    },
    "settings#local-proxy-ports#unique-error-msg": {
        "message": "Yerli portlar biri-birinden tapawutly bolmaly.",
        "description": "Error message that shows if the HTTP local proxy port and SOCKS local proxy port are set to a value and are the same as each other. The local ports must be different from each other. Or one or both of the fields can be empty, which means 'automatic selection'."
    },
    "settings#local-proxy-ports#error-modal-title": {
        "message": "Yerli Proksi portlarynda çaknyşyk",
        "description": "Title of the message box showing the error message when it is detected that the user has chosen a local proxy port (either HTTP or SOCKS) that is already in use and therefore can't be used by Psiphon."
    },
    "settings#local-proxy-ports#error-modal-body-http": {
        "message": "<p>\nSiz aýratyn ýerli portyň HTTP proksini ulanmak üçin Psiphon-y sazladyňyz.<br>\nÝone, ol port eýýäm ulanylýar we Psiphon ulanyp bilenok.\n</p>\n<p>\nHaýyş sazlanan HTTP proksi port hasabyny üýtget we täzeden syna. Psiphon elýeterli porty automatiki saýlamasy üçin, port hasaby arassalamagy maslahat berýäris.\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the HTTP proxy port, rather than the SOCKS proxy port. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#local-proxy-ports#error-modal-body-socks": {
        "message": "<p>\nSiz aýratyn ýerli portyň SOCKS proksini ulanmak üçin Psiphon-y sazladyňyz.<br>\nÝone, ol port eýýäm ulanylýar we Psiphon ulanyp bilenok.\n</p>\n<p>\nHaýyş sazlanan SOCKS proksi port hasabyny üýtget we täzeden syna. Psiphon elýeterli porty automatiki saýlamasy üçin, port hasaby arassalamagy maslahat berýäris.\n</p>",
        "description": "Main text in the 'Local Proxy Port Conflict' dialog box. This is shown when the conflict is with the SOCKS proxy port, rather than the HTTP proxy port. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#expose-local-proxies-to-lan#help-text": {
        "message": "If you have other devices on your network, such as a smart TV or gaming console, you can allow them to use these HTTP and SOCKS proxies while Psiphon is connected.",
        "description": "Help text explaining the setting to allow other devices on the network to use the local Psiphon proxies. Smart TV refers to televisions that have Internet connectivity and apps that access Internet services."
    },
    "settings#expose-local-proxies-to-lan#hint": {
        "message": "<strong>HINT:</strong> You should specify at least one of the port numbers above in order to use this feature. The addresses of the local proxies will be displayed in the logs.",
        "description": "Helpful hint suggesting to set port numbers for the local Psiphon proxies when using the setting to allow other devices on the network to use the local Psiphon proxies."
    },
    "settings#expose-local-proxies-to-lan#enable-label": {
        "message": "Allow other devices on your network to use the local Psiphon proxies",
        "description": "Label for the setting to allow other devices on the network to use the local Psiphon proxies."
    },
    "settings#upstream-proxy#heading": {
        "message": "Upstream Proksi",
        "description": "Settings section heading. In this section the user can specify network information to use an 'upstream proxy', which is a separate proxy that Psiphon will connect through to get to its own server. This is most often used by people in school or work networks that force them to connect out to the Internet through a particular server. This setting can also disable automatic upstream proxy use."
    },
    "settings#upstream-proxy#by-default": {
        "message": "Komýuteriňizde öňden proksi gurnalan bolsa, Psiphon tünel gurnamakda şol proksini ulanar. Haýsy proksini ulanmagy görkezip, üýtgetmegi belläp, ýada “upstream proxy” ulanmazlygy belläp bilersiňiz.",
        "description": "Help text indicating the default (and best) configuration and behavior for the 'Upstream Proxy' setting. It also indicates what will happen if the setting is overridden or disabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#upstream-proxy#reason": {
        "message": "Mekdepler, ýokary okuw jaýlary we edaralar köplenç \"upstream\" proksini talap eder. Eger network üpjün ediji size \"upstream\" proksi sazlamalary beren bolsa, onda birikmek üçin el bilen düzediş gerek bolar.",
        "description": "Help text describing why the user might need to modify the upstream proxy settings in order to successfully connect to the Psiphon server."
    },
    "settings#upstream-proxy#proxy-reqs": {
        "message": "Diñe HTTPS goldayan HTTP proksilara rugsat berilyär.",
        "description": "Help text beside the upstream proxy settings indicating what type of upstream proxies can by used by Psiphon (different proxies are of different types and have different capabilities, and Psiphon has certain requirements)."
    },
    "settings#upstream-proxy#hostname-label": {
        "message": "Eýeady",
        "description": "Label for the text box where the user can set the hostname for the 'upstream proxy'. 'Hostname' means approximately the same thing as 'server network name or identifier'."
    },
    "settings#upstream-proxy#port-label": {
        "message": "Port",
        "description": "Label for the text box where the user can set the network port number for the 'upstream proxy' that they would like to use."
    },
    "settings#upstream-proxy#username-label": {
        "message": "Ulanjyady",
        "description": "Label for the text box where the user can set the username for the 'upstream proxy'."
    },
    "settings#upstream-proxy#password-label": {
        "message": "Açarsözi",
        "description": "Label for the text box where the user can set the password for the 'upstream proxy'."
    },
    "settings#upstream-proxy#domain-label": {
        "message": "Domain",
        "description": "Label for the text box where the user can set the domain for the 'upstream proxy'."
    },
    "settings#upstream-proxy#skip-label": {
        "message": "Yokarky Proksi akymyny ulanma",
        "description": "Label for the checkbox that allows the user to override the default 'upstream proxy' usage and totally disable the feature."
    },
    "settings#upstream-proxy#set-hostname-error-msg": {
        "message": "You must provide a Hostname, or leave all Upstream Proxy fields blank for automatic selection.",
        "description": "Error message that is shown if the user enters a value for one of the other upstream proxy fields but not for 'hostname', which is required. Alternatively, the user can leave all fields blank to allow the automatic behaviour."
    },
    "settings#upstream-proxy#set-username-error-msg": {
        "message": "You must provide a Username if you are setting Password or Domain; or leave all authentication fields blank for no authentication.",
        "description": "Error message that is shown if the user enters a value for one of 'Password' or 'Domain', but does not provide a 'Username' -- this is not valid, as username is are required. Alternatively, the user can leave all authentication fields blank to use an upstream proxy which doesn't require authentication."
    },
    "settings#upstream-proxy#error-modal-title": {
        "message": "Upstream prokside säwlik",
        "description": "Title of the message box showing the error message when a problem is detected with the user's 'upstream proxy settings'."
    },
    "settings#upstream-proxy#error-modal-body-default": {
        "message": "Şuwagt Psihon “upstream proxy” görnüşini ulanmak üçin sazlanan.<br>\nÝöne, Psiphon-a ol proksi arkaly serwere birikmäni başaranok.<br>\nHaýyş “upstream proxy” ulanma we täzeden syna.",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has not directly altered these settings (yet), but the default is causing a problem. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#upstream-proxy#error-modal-body-configured": {
        "message": "Siz “upstream proxy” görnüşinde ulanmak üçin sazlandy.<br>\nÝöne, Psiphon-a ol proksi arkaly serwere birikmäni başaranok.<br>\nHaýyş täzeden sazla we täzeden synanyş.",
        "description": "Main text in the 'Upstream Proxy Error' dialog box. This is shown when the user has directly altered these settings, and those settings are (probably) erroneous. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#transport-mode#heading": {
        "message": "Geçirmek Görnüşi",
        "description": "Settings section heading. In this section the user can choose to use an alternative connection and data transfer method -- also known as 'transport'."
    },
    "settings#transport-mode#check-label": {
        "message": "L2TP/IPSec görnüşi ullan",
        "description": "Label for the checkbox that allows the user to indicate that they want to use the non-default network transport mode. This mode is generally inferior for circumvention and not recommended. 'L2TP/IPSec' is the technical name for a type of virtual private network and should probably not be translated."
    },
    "settings#transport-mode#help-text": {
        "message": "Windows L2TP/IPSec wirtual network-ini ulanýar. Bu görnüş siziň ähli programmalary tunel eder, emma ol güýçli senzuralary geçmekde we gizlin galmakda ukypsyzdyr. Bu böwetli saýtlary geçmek üçin<strong>maslahat berilenok</strong>.",
        "description": "Help text for the 'Use L2TP/IPSec mode' transport selection checkbox. It gives some technical details and indicates that this mode is not recommended."
    },
    "settings#systray-minimize#heading": {
        "message": "Duýduryş Bölümine Kiçelt  (System Tray)",
        "description": "Settings section heading. In this section the user can choose to enable or disable the ability for the Psiphon application window to be hidden as a notification area icon when minimized. 'Notification area' is the official term for the icons located near the clock on the Windows taskbar, but it's also often called the 'system tray' or 'systray' -- use whatever is most common in your language, and be verbose if necessary."
    },
    "settings#systray-minimize#help-text": {
        "message": "Işledilende, kiçeldilen Psiphon programma penjiresi duýduryş bölüminde gizlener.(Windows-da ýumuş çybygynda, sagat görkezijiniň ýanynda ýerleşýän köplenç \"system tray\" ýada \"systray\" atlandyrylýar)",
        "description": "Text explaining to the user what the 'Minimize to Notification Area (System Tray)' setting does if enabled. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#systray-minimize#reason": {
        "message": "Ýumuş çybygynda yer açmak, duýduryş bölümine (\"system tray\") Psiphon-y kiçeltmek arkaly bolar. Bu Psiphony uzak wagtlap işlemegini kömek eder.",
        "description": "Help text in the 'Minimize to Systray' settings section explaining to the user why they might want to enable it. The word 'Psiphon' must not be translated or transliterated."
    },
    "settings#systray-minimize#enable-label": {
        "message": "Duýduryş bölümine Kiçelt  (System Tray)",
        "description": "The label on the checkbox that enables 'Minimize to Notification Area (System Tray)'."
    },
    "settings#applying-message": {
        "message": "Sazlamalary ulanmak üçin täzeden birikýär.",
        "description": "Pop-up message shown to users after they have changed their settings and a reconnection is happening to apply the new settings."
    },
    "settings#saved-message": {
        "message": "Sazlamalar yatda saklanyldy.",
        "description": "Pop-up message shown to users after they have changed their settings (but they aren't currently connected, so there's no reconnect or further action)."
    },
    "settings#error-modal#title": {
        "message": "Sazlamalar Säwlik",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This string is the title of the modal box."
    },
    "settings#error-modal#body": {
        "message": "Sazlama hasaplarda näsazlyk bar. Haýyş dowam etmezden öň düzediň.",
        "description": "This modal dialog box is shown when the user tries to save their settings, but there is an error in the values they have entered. This body is the title of the modal box."
    },
    "feedback#top_content_title": {
        "message": "Seslenme beriň",
        "description": "Title for the Feedback page"
    },
    "feedback#top_para_2": {
        "message": "Iň soňky görnüşi ýüklemek arkaly köp yüze çykan meseleleri düzedip bolar. Siz<a class=\"NewVersionURL\" href=\"#\">şu ýere basyp iň soňky görnüşi ýükläp bilersiňiz</a>, ýada email ugradyp bilersiňiz<a class=\"NewVersionEmail\" href=\"#\"></a>.",
        "description": "Text telling the user that downloading a new version of Psiphon may be beneficial, and how to get a new version."
    },
    "feedback#top_para_3": {
        "message": "Siz umumy meseleriň çözgüdini biziń <a class=\"FaqURL\" href=\"#\">Yygy-ýygydan Soralýan Soraglar</a>bölüminde tapyp bilersiñ.",
        "description": "Text telling the user how to get to the Psiphon FAQ."
    },
    "feedback#smiley_happy": {
        "message": "Psiphon islegime görä birikýär we işleýär.",
        "description": "The text below the 'happy face' feedback choice. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#smiley_sad": {
        "message": "Psiphon köplenç birikmegi şowsuz yada kanagatlandyryjy işlemeýär. ",
        "description": "The text below the 'sad face' feedback choice. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#text_feedback_prompt": {
        "message": "Haýyş, öz teswiriñizi bu ýere yaz:",
        "description": "Label for a text box where the user can provide a feedback message to Psiphon Inc."
    },
    "feedback#text_feedback_email_prompt": {
        "message": "Eger-de bizden jogap almagy islesenñiz, onda öz email salgyñyzy su yerde yazyñ:",
        "description": "Label for a text field where the user can provide an email address to Psiphon Inc. along with their feedback."
    },
    "feedback#diagnostic_check": {
        "message": "Diagnostiki maglumatlary ýükle. Bellik, bu diagnostiki maglumatlar sizi belli etmez, we ol bize Psiphon kadaly işlemegine kömek eder. <a class=\"dataCollectionInfoURL\" href=\"#\">Biziň nähili maglumat topýanymyzy görmek üçin şu ýere bas.</a>",
        "description": "Checkbox text. If it is checked, diagnostic information about Psiphon's status will be sent along with the feedback to Psiphon Inc. The word 'Psiphon' must not be translated or transliterated."
    },
    "feedback#submit_button": {
        "message": "Iber",
        "description": "Submit button text. If the user clicks it, their feedback will be sent to Psiphon Inc."
    },
    "feedback#text_feedback_bottom_para": {
        "message": "Eger-de ýokardaky forma işlemeýän bolsa ýa-da ekran suradyny ibermek isleseňiz, haýyş bize<a id=\"FeedbackEmailAddress\" href=\"mailto:feedback@psiphon.ca\">feedback@psiphon.ca</a> email ugradyñ. ",
        "description": "Message showing the user an email they can use to contact Psiphon Inc."
    },
    "feedback#success-message": {
        "message": "<strong>Sag Boluň!</strong> Siziň seslenmäňiz iberildi.",
        "description": "Message shown to user after their feedback has been sent successufully"
    },
    "logs#show-debug-label": {
        "message": "\"Debug\" loglary görkez",
        "description": "Label on a checkbox. If the user checks it, debug log messages will be shown to the user."
    },
    "logs#placeholder": {
        "message": "Hiç hili loglar ýok",
        "description": "Placeholder text shown when there are not yet any log messages to show. This message is removed when the first log message is added."
    },
    "language#success-message": {
        "message": "<strong>Salam!</strong>Psiphon hoş geldiñiz.",
        "description": "A welcome message shown to the user when they first switch to the correct UI language. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#wordart-tag": {
        "message": "Çäklerinden daşarda",
        "description": "The application/product/tool tagline/slogan/motto part of the fancy title at the top of the 'About' page. 'Beyond Borders' is the slogan that is also used on the Psiphon website -- it is meant to suggest that Psiphon can help users to get to the internet beyond the border (firewall) of the country they live in. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#description": {
        "message": "Psiphon  <strong>senzuranyň öňüni alyjy enjam</strong>. Senzuralary we böwetli girişleri geçmek üçin dizaýn edilen, çäksiz Internet giriş enjamy. Ol <strong>açyk çeşme</strong> we Kanadanyň Tortonto şäherinde döredilen.",
        "description": "Paragraph on the 'About' page telling users generally what Psiphon is. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#visit-download-site": {
        "message": "Haýyş  <strong><a class=\"NewVersionURL\" href=\"#\">täze görnüşi indirmek</a>ýada<a class=\"InfoURL\" href=\"#\">kömek we maglumat almak üçin</a>websaýta gir. Psiphon Android we Windows üçin elýeterli.",
        "description": "Paragraph on the 'About' page telling users what web page to go to get a new version of Psiphon or more info about it. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#get-by-email": {
        "message": "<strong>eger websaýtda girip bolmasa</strong>, siz Psiphon-yň täze görnüşini almak üçin email ugradyp bilersiňiz:",
        "description": "Paragraph on the 'About' page telling users that they can also get a new version of Psiphon via email. The text in this resource is then followed by an email address. The word 'Psiphon' must not be translated or transliterated."
    },
    "about#client-version": {
        "message": "Psiphon Windows müşderi wersiýasy üçin:",
        "description": "Footer on the 'About' page indicating the client version number. This text is the prefix to the actual number. Like: 'Psiphon for Windows client version: 88'. The word 'Psiphon' must not be translated or transliterated."
    },
    "general#modal-close-button": {
        "message": "Ýap",
        "description": "Text in the button that dismisses a modal dialog. It is often the only button (no 'OK' or 'Cancel', etc.)."
    },
    "general#notice-modal-tech-preamble": {
        "message": "Bu ýerde tehnikis äwlik informasiyasini tapyp bilersiñiz:",
        "description": "Preamble before the technical message relating to the error being shown. This is generated within the code and may not be very user-friendly (but it may be necessary for the user to figure out what's wrong)."
    },
    "notice#systemproxysettings-setproxy-error-title": {
        "message": "Proksi Sistemasynda Säwlik",
        "description": "Title of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon."
    },
    "notice#systemproxysettings-setproxy-error-body": {
        "message": "<p>Psiphon sistema proksiniň sazlamasy şowsuz.</p>\n<p>Antiwirus programmasy bilen näsazlyk sebäpli bolup biler. Ýerli Psiphon proksini ulanmak üçin siz sazlamalary täzeden elde düzeltmeli. Psiphon proksileri.</p>",
        "description": "Body text of modal error message shown to user when Psiphon fails to set the user's system proxy settings. This means that Psiphon was able to connect, but was unable to configure the system to actually use Psiphon. The word 'Psiphon' must not be translated or transliterated."
    },
    "notice#systemproxysettings-setproxy-warning-template": {
        "message": "Psiphon  “<%- data %>” atly Internet baglanşygy üçin sistemanyň proksi sazlanmasy şowsuz. Antiwirus programmasy bilen näsazlyk sebäpli bolup biler. Ýerli Psiphon proksini ulanmak üçin siz sazlamalary täzeden elde düzeltmeli.",
        "description": "'<%- data %>' is a placeholder and must not be modified. Log message emitted when Psiphon can't fully configure the system to use Psiphon. It may or may not be a fatal state, and may or may not need human intervention. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-stopped-title": {
        "message": "Psiphon birikmedi",
        "description": "Appears in the notification area balloon when Psiphon is disconnected (or has lost its connection, or has been disconnected). The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-starting-title": {
        "message": "Psiphon birikýär",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-starting-body": {
        "message": "Haýyş garaşyñ...",
        "description": "Appears in the notification area balloon when Psiphon is in the process of connecting to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-title": {
        "message": "Psiphon birikdi",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-body": {
        "message": "Çäkleriñden daşary syyahat et!",
        "description": "Appears in the notification area balloon when Psiphon is currently connected to a server. Specifically, it appears when the connection has just completed. This is intended to be a reference to the 'Psiphon: Beyond Borders' tag line. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system."
    },
    "appbackend#state-connected-reminder-title": {
        "message": "Psiphon sizi birikdirilgi saklar",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-reminder-body": {
        "message": "Psiphony mugut sakla! Biziñ hemaýatkär sahypamyzy görmek üçin śu yere bas!",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. This is intended to encourage the user to visit the sponsor's landing page. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#state-connected-reminder-body-2": {
        "message": "Psiphon-y mugt saklamak üçin, hemayatkär sahypalara geç! ",
        "description": "Appears in the notification area balloon periodically while Psiphon is connected to a server. This is intended to encourage the user to visit the sponsor's landing page. Note for right-to-left languages: You should not use an exclamation mark, as it won't be displayed correct if shown on a left-to-right operating system. The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#minimized-to-systray-title": {
        "message": " Duýduryş meýdana göra Psiphon kiçeldildi",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons). The word 'Psiphon' must not be translated or transliterated."
    },
    "appbackend#minimized-to-systray-body": {
        "message": "Programmany dikeltmek üçin şu şekiljige bas",
        "description": "Appears in the notification area balloon when Psiphon has been minimized to the Windows' notification area (aka 'system tray' aka 'systray', the area of the taskbar with the clock, battery indicator, and other icons)."
    },
    "appbackend#os-unsupported": {
        "message": "Psiphon no longer supports Windows XP or Vista.\nPlease visit our website for more information.",
        "description": "Appears in a message box when Psiphon is run on an unsuppoted version of Windows. Is followed by a URL."
    },
    "psicash#transaction-error-title": {
        "message": "PsiCash transaction error",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-error-body": {
        "message": "Your PsiCash transaction attempt failed unexpectedly.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ExistingTransaction-title": {
        "message": "PsiCash purchase already exists",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ExistingTransaction-body": {
        "message": "You have an existing PsiCash purchase of this type. Another purchase of this type is not allowed until the previous one expires. Your PsiCash state will be refreshed now.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InsufficientBalance-title": {
        "message": "Insufficient PsiCash balance",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The user doesn't have enough PsiCash to make the attempted purchase. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InsufficientBalance-body": {
        "message": "You do not have sufficient PsiCash balance for this purchase.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The user doesn't have enough PsiCash to make the attempted purchase. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionAmountMismatch-title": {
        "message": "PsiCash purchase price mismatch",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionAmountMismatch-body": {
        "message": "PsiCash purchase prices are out-of-date. Your PsiCash state will be refreshed now.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionTypeNotFound-title": {
        "message": "PsiCash purchase type not found",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-TransactionTypeNotFound-body": {
        "message": "The product you are trying to buy no longer exists. You may need to update or reinstall the application.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InvalidTokens-title": {
        "message": "Invalid PsiCash tokens",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InvalidTokens-body-tracker": {
        "message": "Your PsiCash tokens are invalid. Try restarting the application. If that doesn't work, you will need to <a href=\"https://psiphon3.com/faq.html#clear-windows-data\">clear your local storage</a>.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-InvalidTokens-body-account": {
        "message": "Your PsiCash tokens have expired. Log into your account and try again.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ServerError-title": {
        "message": "PsiCash server error",
        "description": "Title of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#transaction-ServerError-body": {
        "message": "The PsiCash server responded with an error while trying to make the purchase. Please retry your purchase later.",
        "description": "Body text of a modal dialog shown when a PsiCash transaction (like Speed Boost purchase) fails. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-speedboost-active": {
        "message": "Speed&nbsp;Boost active for %s",
        "description": "When the user has Speed Boost active, this shows them how much time they have remaining. '%s' is like 'an hour' or '30 minutes' (localized). This text will be shown on a narrow button that should have at most 3 lines. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#ui-buypsi": {
        "message": "Buy PsiCash",
        "description": "Label for a button/link that opens a store web page were users can spend money to buy PsiCash. At this point, the user has no PsiCash at all. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-buymorepsi": {
        "message": "Buy more PsiCash",
        "description": "Label for a button/link that opens a store web page were users can spend money to buy PsiCash. At this point, the user already has some PsiCash, but may wish to buy more. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#ui-nsfbalance-buttontext": {
        "message": "Needed for Speed&nbsp;Boost",
        "description": "Label on a disabled button, followed by a value in PsiCash indicating how much it costs to buy an hour of Speed Boost. When the user has enough PsiCash, the button will be enabled and the text will change. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#ui-speedboost-button": {
        "message": "Speed Boost",
        "description": "Label on a button. The text is followed by a value in PsiCash indicating how much it costs to buy an hour of Speed Boost. Clicking the button will buy Speed Boost. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#1-hour": {
        "message": "1 hour",
        "description": "Label on a button. Clicking this button will buy 1 hour of Speed Boost."
    },
    "psicash#1-day": {
        "message": "1 day",
        "description": "Label on a button. Clicking this button will buy 1 day (24 hours) of Speed Boost."
    },
    "psicash#1-week": {
        "message": "1 week",
        "description": "Label on a button. Clicking this button will buy 1 week (7 days) of Speed Boost."
    },
    "psicash#1-month": {
        "message": "1 month",
        "description": "Label on a button. Clicking this button will buy 1 month (31 days) of Speed Boost."
    },
    "psicash#ui-buyingboost-buttontext": {
        "message": "Starting Speed&nbsp;Boost!",
        "description": "Label for a disabled button. The user has clicked the button in order to buy an hour of Speed Boost, and now the purchase is completing and Speed Boost is activating. You may use `&nbsp;`, `<br>`, `<wbr>`, `&shy;`, etc. to control word wrap. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#pane-create-account": {
        "message": "Create an account to protect your PsiCash!",
        "description": "Text for a link displayed when the user does not have a PsiCash account. This is an strong suggestion, hence the exclamation point -- use whatever makes sense in your language. It encourages them to make one. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#pane-balance-header": {
        "message": "Balance:",
        "description": "Text before showing the user's PsiCash balance. So it will appear like: 'Balance: Ⓟ100'."
    },
    "psicash#pane-log-in": {
        "message": "Log In!",
        "description": "Text on a button that will lead the user to log into their PsiCash account. This is an strong suggestion, hence the exclamation point -- use whatever makes sense in your language."
    },
    "psicash#pane-log-out": {
        "message": "Log Out",
        "description": "Text on a button that will log the user out of their PsiCash account."
    },
    "psicash#pane-manage-web": {
        "message": "Manage on the web",
        "description": "Text for a link to a web site where users can manage their PsiCash account."
    },
    "psicash#pane-create-account-plea": {
        "message": "Creating a PsiCash account will help preserve your PsiCash if you clear the app's storage or use Psiphon on another device. <a href=\"https://psiphon.ca/faq.html#psicash-account\">Learn more.</a>",
        "description": "Text shown below the PsiCash balance when the user does not have a PsiCash account. 'Learn more' is a link to an FAQ entry explaining the benefits of creating an account. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#pane-l2tp-incompatible": {
        "message": "Speed Boost cannot be used while Psiphon is connected in <a href=\"#\">L2TP/IPSec transport mode</a>.",
        "description": "A message shown when L2TP/IPSec mode is enabled in Psiphon. Speed Boost cannot be used in this mode."
    },
    "psicash#pane-must-log-in": {
        "message": "You must log in to use PsiCash.",
        "description": "Message shown when the user was logged in with an account and then logged out. It's telling the user that they have to log in again. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#pane-create-new-account": {
        "message": "Create a New Account",
        "description": "Text on button that user can click to create a new account (opens an external web page)."
    },
    "psicash#pane-speed-port-limits-head": {
        "message": "Speed and Port Limits",
        "description": "Heading for an information section explaining that there are port and speed restrictions when the user doesn't have Speed Boost active."
    },
    "psicash#pane-speed-port-limits-body": {
        "message": "Without active Speed Boost, your speed is limited and some internet traffic is not supported. Activate Speed Boost with PsiCash to unlock the full potential of your Psiphon experience.",
        "description": "Body of an information section explaining that there are port and speed restrictions when the user doesn't have Speed Boost active. The word 'PsiCash' must not be translated or transliterated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#pane-speed-boost-cta": {
        "message": "Unleash the full potential of Psiphon with Speed&nbsp;Boost!",
        "description": "Text encouraging the user to purchase Speed Boost. 'Unleash' can translated to something like 'unlock', 'release', 'enable', 'amplify', or generally 'make a lot better'. 'Psiphon' must not be translated/transliterated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#pane-need-more-psicash-header": {
        "message": "You need more PsiCash!",
        "description": "Header for a section telling the user that they don't have enough PsiCash to buy any Speed Boost and need to buy more. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#pane-need-more-psicash-body": {
        "message": "In order activate Speed Boost, you need to buy more PsiCash.",
        "description": "Body of a section telling the user that they don't have enough PsiCash to buy any Speed Boost and need to buy more. The word 'PsiCash' must not be translated or transliterated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#pane-need-psicash-visit-store": {
        "message": "Need PsiCash? Visit our store to buy more!",
        "description": "Text encouraging the user to buy PsiCash (with real money). The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#overlay-logging-in": {
        "message": "Logging in…",
        "description": "Text on a screen shown while the user's log-in request is in progress."
    },
    "psicash#overlay-logging-out": {
        "message": "Logging out…",
        "description": "Text on a screen shown while the user's log-out request is in progress."
    },
    "psicash#modal-create-psicash-account-header": {
        "message": "Create a PsiCash Account",
        "description": "Header of a modal dialog that appears when the user tries to buy PsiCash with real money but doens't have an account. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-create-psicash-account-body": {
        "message": "We strongly encourage you to create a PsiCash account before buying PsiCash. Having an account allows you to share your balance between devices and protect your purchases.",
        "description": "Body of a modal dialog that appears when the user tries to buy PsiCash with real money but doens't have an account. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-create-psicash-account-create-button": {
        "message": "Create or log into account",
        "description": "Button in the modal dialog encouraging users to create an account when they attempt to buy PsiCash with real money without one. If they click this button, they will be taken to a screen where they can create an account or log into an existing one."
    },
    "psicash#modal-create-psicash-account-continue-button": {
        "message": "Continue without account",
        "description": "Button in the modal dialog encouraging users to create an account when they attempt to buy PsiCash with real money without one. If they click this button, they will continue on to the PsiCash store."
    },
    "psicash#modal-psicash-logout-offline-header": {
        "message": "PsiCash Account Logout",
        "description": "Header of a modal dialog that appears when the user tries to log out of their PsiCash account. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-psicash-logout-offline-body": {
        "message": "Being connected to the Psiphon network enables a more secure PsiCash logout. Would you like to connect before logging out?",
        "description": "Body of a modal dialog that appears when the user tries to log out of thier PsiCash account while not currently connected to the Psiphon network. We don't allow PsiCash network requests when not connected, so only an inferior localy-only logout is available. 'Psiphon' must not be translated/transliterated. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-psicash-logout-offline-connect-button": {
        "message": "Birikdirildi",
        "description": "Button in the modal dialog shown to users when they attempt to log out of their PsiCash account with no active Psiphon tunnel. Clicking this button will abort the logout attempt and being connecting to a Psiphon server."
    },
    "psicash#modal-psicash-logout-offline-logout-anyway-button": {
        "message": "Log out anyway",
        "description": "Button in the modal dialog shown to users when they attempt to log out of their PsiCash account with no active Psiphon tunnel. Clicking this button will cause a local-only logout to be performed."
    },
    "psicash#modal-psicash-logout-offline-cancel-button": {
        "message": "Goýbolsun et",
        "description": "Button in the modal dialog shown to users when they attempt to log out of their PsiCash account with no active Psiphon tunnel. Clicking this button will cancel the attempt."
    },
    "psicash#modal-login-header": {
        "message": "PsiCash Account",
        "description": "Header of modal dialog in which the user can log in to an existing account or click a link to create a new one. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-login-body": {
        "message": "<a class=\"js-psicash-account-signup\" href=\"#\">Create a new account</a> or log in below.",
        "description": "Body of modal dialog in which the user can log in to an existing account or click a link to create a new one."
    },
    "psicash#modal-login-username-field": {
        "message": "Ulanjyady",
        "description": "Label for a username field in the PsiCash account login modal dialog."
    },
    "psicash#modal-login-password-field": {
        "message": "Açarsözi",
        "description": "Label for a password field in the PsiCash account login modal dialog."
    },
    "psicash#modal-login-forgot-passwork-link": {
        "message": "Forgot your username or password?",
        "description": "Link for text in the PsiCash account login modal dialog. Clicking it will bring the user to a page where they can recover their account."
    },
    "psicash#modal-login-submit-button": {
        "message": "Iber",
        "description": "Text on the submit button in the PsiCash account login modal dialog."
    },
    "psicash#modal-login-cancel-button": {
        "message": "Goýbolsun et",
        "description": "Text on the cancel button in the PsiCash account login modal dialog."
    },
    "psicash#alert#buyspeedboost-purchase-complete": {
        "message": "Speed Boost started!",
        "description": "A non-modal alert shown when a new Speed Boost has been activated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "psicash#modal-logout-header": {
        "message": "PsiCash Account Logout",
        "description": "Header of modal dialog shown when the user attempts to log out of their PsiCash account and a message results. 'PsiCash' must not be translated or transliterated."
    },
    "psicash#modal-logout-error-body": {
        "message": "You logout attempt failed unexpectedly. Please try restarting the application. If that doesn't work, you will need to <a href=\"https://psiphon3.com/faq.html#clear-windows-data\">clear your local storage</a>.",
        "description": "Body of modal dialog shown when the user attempts to log out of their PsiCash account and an unexpected error occurs. Please don't modify the link URL."
    },
    "positive-value-indicator": {
        "message": "+%d",
        "description": "This is used to indicate when a numeric value is positive -- like '+500'. This will show when a number is going to be increased by another number. '%d' is a placeholder for an integer for decimal value."
    },
    "psicash#mustconnect-modal#title": {
        "message": "Psiphon Connection Required",
        "description": "Title text of a modal dialog shown when the user tries to use (spend, buy, etc.) PsiCash, if they not currently connected. 'Psiphon' must not be translated/transliterated."
    },
    "psicash#mustconnect-modal#body": {
        "message": "In order to use PsiCash, you must be connected to the Psiphon network.",
        "description": "Body text of a modal dialog shown when the user tries to use (spend, buy, etc.) PsiCash, if they not currently connected. 'Use' here means buy, spend, or otherwise interact with. 'Psiphon' must not be translated/transliterated. 'PsiCash' must not be translated/transliterated."
    },
    "psicash#init-error-title": {
        "message": "PsiCash initialization error",
        "description": "Title of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#init-error-body-unrecovered": {
        "message": "PsiCash failed to initialize. This is probably due to a file system problem, such as being out of disk space. Your balance and other state have been lost. PsiCash will not be usable. You can try restarting the application to recover from the problem.",
        "description": "Body text of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#init-error-body-recovered": {
        "message": "PsiCash failed to initialize. This is probably due to a file system problem, such as being out of disk space. Your balance and other state have been reset.",
        "description": "Body text of a modal dialog shown when the PsiCash library fails to initialize. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#psiphon-speed": {
        "message": "Psiphon<br>Speed",
        "description": "Text on a badge next to an image or gauge that will indicate 'fast' or 'slow'. This is the current Psiphon tunnel speed limit. Speed Boost is required in order to get the fastest speed. The word 'Psiphon' must not be translated or transliterated. The word 'Psiphon' can be dropped if necessary to get a meaning like 'speed limit'. This text must be kept narrow and short -- only two or three lines of one or two words each. Use hard breaks (like <br>) to separate lines (perhaps with hyphens), and soft break indicators (like &shy; or <wbr> or &#8203;) to indicate were long words can be broken."
    },
    "psicash#psiphon-speed-nobreak": {
        "message": "Psiphon Speed",
        "description": "Text on a badge next to an image or gauge that will indicate 'fast' or 'slow'. This is the current Psiphon tunnel speed limit. Speed Boost is required in order to get the fastest speed. The word 'Psiphon' must not be translated or transliterated. The word 'Psiphon' can be dropped if necessary to get a meaning like 'speed limit'. This text must be kept short."
    },
    "psicash#corner-logged-out": {
        "message": "You are logged out of PsiCash",
        "description": "Message shown to the user when they have a PsiCash account, but they are logged out. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#more-ellipsis": {
        "message": "More…",
        "description": "Label for a button that leads to more Speed Boost purchase choices. The translation can be like 'More options' or 'More choices' or 'See more'. Only use an ellipsis if it makes sense in your language."
    },
    "psicash#login#failure-modal-title": {
        "message": "PsiCash Login Failed",
        "description": "Title of modal dialog shown when the PsiCash account login attempt fails for some reason. Text within the modal will explain why. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#login#catastrophic-error-body": {
        "message": "Your PsiCash login attempt failed unexpectedly.",
        "description": "Body text of a modal dialog shown when a PsiCash login fails without a specific reason. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#login#invalid-credentials-body": {
        "message": "The username or password entered was incorrect.",
        "description": "Body text of a modal dialog shown when a PsiCash login fails due to bad username or password."
    },
    "psicash#login#server-error-body": {
        "message": "The PsiCash server responded with an error while trying to log you in. Please try again later.",
        "description": "Body text of a modal dialog shown when a PsiCash account login fails due to a server error. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#login#badrequest-error-body": {
        "message": "The PsiCash server indicated that the login request was invalid. Please re-enter your login information and try again.",
        "description": "Body text of a modal dialog shown when a PsiCash account login fails due to a 'bad request' error. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#login#success-modal-title": {
        "message": "PsiCash Login Success",
        "description": "Title of modal dialog shown when the PsiCash account login attempt succeeds, if additional information needs to be conveyed. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#login#last-tracker-merge-body": {
        "message": "You are logged into your PsiCash account. The preexisting balance from this device has been transferred into your account, but this is the last time a balance merge will occur.",
        "description": "Body text of a modal dialog shown when a PsiCash login succeeds. There is a fixed number of times that a user can merge a pre-account balance into a PsiCash account. This message indicates that the user has hit that limit and the merge that occurred is the last one allowed. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#alert#tokens-expired": {
        "message": "PsiCash login expired. Please log back in.",
        "description": "An alert shown when the user's PsiCash account tokens expire. This is a normal occurrence (once per year), and the user needs to log into their PsiCash account again to continue to use it. The word 'PsiCash' must not be translated or transliterated."
    },
    "psicash#alert#logged-out": {
        "message": "PsiCash account logout complete.",
        "description": "An alert shown when the user logs out of their PsiCash account. The word 'PsiCash' must not be translated or transliterated."
    },
    "notice#disallowed-traffic-alert-title": {
        "message": "Upgrade your Psiphon connection",
        "description": "Title of modal error message shown to user when Psiphon disallows some non-web internet traffic. The user will be told to 'upgrade' their connection with Speed Boost (giving more speed and app compatibility). The word 'Psiphon' must not be translated or transliterated."
    },
    "notice#disallowed-traffic-alert-body": {
        "message": "<p>Apps not working?</p>\n<p>Some internet traffic is not supported without an active Speed Boost. Activate Speed Boost with PsiCash to unlock the full potential of your Psiphon experience.</p>",
        "description": "Body text of modal error message shown to user when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed. The words 'Psiphon' and 'PsiCash' must not be translated or transliterated. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "appbackend#disallowed-traffic-notification-title": {
        "message": "Apps not working?",
        "description": "Appears in the notification area balloon when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed."
    },
    "appbackend#disallowed-traffic-notification-body": {
        "message": "Activate Speed Boost to unlock the full potential of your Psiphon experience.",
        "description": "Appears in the notification area balloon when Psiphon disallows some non-web internet traffic. The user needs to purchase Speed Boost in order to full app compatibilty and more speed. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "settings#disallowed-traffic-alert#heading": {
        "message": "Disallowed Traffic Alert",
        "description": "Settings section heading. In this section the user can choose to enable or disable alerts telling the user when app traffic has been disallowed and they need to get Speed Boost."
    },
    "settings#disallowed-traffic-alert#help-text": {
        "message": "Some types of internet traffic are not supported without an active Speed Boost. When such traffic is disallowed, an alert is shown. (Re-enabling will require a reconnection.)",
        "description": "Text explaining to the user what the 'Disallowed Traffic Alert' setting does if enabled. 'Speed Boost' is a reward that can be purchased with PsiCash credit. It provides unlimited network connection speed through Psiphon. Other words that can be used to help with translation are: 'turbo' (like cars), 'accelerate', 'warp speed', 'blast off', or anything that indicates a fast or unrestricted speed."
    },
    "settings#disallowed-traffic-alert#disable-label": {
        "message": "Disable disallowed traffic alerts",
        "description": "The label on the checkbox that disables the 'Disallowed Traffic Alert'."
    },
    "ui#alert#url-copied-to-clipboard": {
        "message": "URL copied to clipboard.<br>If browser fails to open, paste the URL into the browser address bar.",
        "description": "Sometimes when the Psiphon UI tries to open an external URL in the browser, it fails to open. This message indicates to the user that URL has been copied to the Windows system clipboard and is available for pasting into a browser. `<br>` may be used to split the message over two lines to ensure the alert doesn't take too much horizontal space."
    },
    "banner#sponsored-by": {
        "message": "Hemaýatkär",
        "description": "Text appears above the sponsor banner image. So it kind of reads 'Sponsored by BBC' (for example)."
    }
}